{
  "sports": [
    {
      "topic": "sports",
      "title": "Carlton announce Charlie Curnow’s season ended by another knee operation",
      "author": "Glenn Valencich",
      "source": "7News",
      "url": "https://7news.com.au/sport/afl/charlie-curnows-season-over-as-carlton-announce-shock-knee-surgery-c-19536987",
      "published": "2025-07-31T07:44:20+00:00",
      "content": "Carlton have announced Charlie Curnow’s season is over after it was decided the key forward required “necessary” knee surgery.\n\nThe 28-year-old, who has a long history of knee troubles, reported soreness after last Thursday’s loss to Hawthorn.\n\nCurnow was adamant last week that he would not require surgery despite his issues this year.\n\nKnow the news with the 7NEWS app: Download today\n\nBut the call to go under the knife comes after he missed the start of the 2025 campaign following a knee operation in December last year.\n\nIn a statement on Thursday night, Carlton football boss Brad Lloyd said Curnow “wanted to finish the season” but the club overruled the key forward.\n\n“We would have loved to have him out there for the remaining games,” Lloyd said.\n\n“After further consultation this week it became clear that this would give Charlie the best chance to get himself right, recover fully over the off-season and be ready for when we return for the start of pre-season.\n\n“Waiting until the end of the season could have impacted that, so we’ve taken the sensible approach.”\n\nCurnow was already expected to miss Carlton’s clash with Fremantle in Perth on Sunday prior to the surgery decision.\n\nCurnow missed two years of football across 2019-21 with knee injuries before he returned to become a dual Coleman medallist.\n\nBut his 2025 campaign ends with 32 goals to his name from 18 appearances for a struggling Blues side that has long been out of finals contention.\n\nCurnow recently shut down speculation that he could request a trade, following reports he entertained the idea of moving to the Gold Coast Suns.\n\n“I obviously want to be here,” Curnow said.\n\n“I don’t really want to make this about me right now, but I’m playing at Carlton next year. There you go. Done.”\n\nCurnow is under contract until 2029.\n\nHis commitment, should it hold through the trade period, would be a boost with the Blues still uncertain if Tom De Koning will stick fat or take up a monster offer to join St Kilda.\n\nPundits have also previously suggested Carlton should consider trading Curnow’s partner in crime Harry McKay, who is locked in until 2030, at the end of the season.",
      "frequency": 1
    },
    {
      "topic": "sports",
      "title": "Channel 7 stars poke fun at Fox Footy’s ‘awkward’ nickname policy",
      "author": "Digital Staff",
      "source": "7News",
      "url": "https://7news.com.au/sport/afl/channel-7-pokes-fun-at-fox-footys-awkward-commentator-nicknames-policy-c-19538028",
      "published": "2025-07-31T09:47:35+00:00",
      "content": "Channel 7 commentators have poked fun at rival broadcaster Fox Footy’s “awkward” new policy banning commentators from referring to each other by their nicknames.\n\nThe directive was quietly introduced this month and quickly noted by discerning fans, becoming a hot topic on radio where talent from both TV networks are colleagues.\n\nAnd Channel 7 stars couldn’t resist a jab when Thursday night’s broadcast began ahead of the Bulldogs’ clash with the Giants.\n\nKnow the news with the 7NEWS app: Download today\n\nThe standard graphic listing the commentators stopped short of full names, instead displaying BT (Brian Taylor), Hame (Hamish McLachlan), Hodgey (Luke Hodge) and Rooey (Nick Riewoldt).\n\nRight before the bounce BT introduced the commentary team using nicknames, although he did slip up on Rooey.\n\n“Good to have Hodgey, Hame, Nick and all the boys here for this one on a Thursday night,” BT said, while the introductions did not go unnoticed by fans.\n\nKane Cornes broached the Fox directive with SEN co-host and Fox commentator David King on their morning radio show.\n\n“It sounds awkward. I’m sure we’ll get used to it,” he asked.\n\n“But what’s happened? Was this an all-of-staff meeting? Was it a memo?”\n\nKing conceded “it was a bit of a shock to the system” to learn what was now required.\n\n“You just get told by your fellow workmates, we’re going with first names,” he said.\n\n“It does sound funny, doesn’t it?\n\n“I would think I was born ‘Kingy’. I don’t know why they wasted their time putting David on my birth certificate.”\n\nHead here to watch AFL live, free and on-demand on 7plus Sport\n\nJason Dunstall said there were “considerations that perhaps we’re being a little bit too in-house” for viewers.\n\n“Please I hope no one ever at Triple M says we can’t use nicknames. Because you are ‘The Chief’ and you always will be in my eyes,” Damian Barrett said.\n\nGarry Lyon felt like he was in trouble with his parents every time he heard his given name.\n\n“I found it highly unusual. I am a nicknamer. I’m a nickname giver and I’m a nickname user,” he said.\n\n“So for me to call Jason Dunstall, Jason, on Friday night was one of the more difficult things I’ve had to do.”",
      "frequency": 1
    },
    {
      "topic": "sports",
      "title": "Master NRL coach Wayne Bennett bans Triple M after grubby joke about partner, Dale Cage",
      "author": "Cameron Noakes",
      "source": "7News",
      "url": "https://7news.com.au/sport/rugby-league/master-nrl-coach-wayne-bennett-bans-triple-m-after-grubby-joke-about-partner-dale-cage-c-19534098",
      "published": "2025-07-31T04:22:55+00:00",
      "content": "Wayne Bennett has banned radio station Triple M after the network made a grubby joke about the master NRL coach’s partner, Dale Cage.\n\nTriple M presenters seemingly lost their ‘respect’ radar, and decided to poke fun at Cage (they commented on her breast size) and the breakdown of Bennett’s marriage to former partner Trish.\n\nTriple M has since apologised to Bennett but the damage has been done. It is unclear how long the Bennett ban will last, but he is refusing to speak to the station ahead of and after Souths’ clash with the Broncos this week.\n\nKnow the news with the 7NEWS app: Download today\n\nThe prank involved the network conducting a mock interview with Bennett, and they used a soundbite (on repeat) from a Bennett media conference to respond to their questions.\n\nFollowing the loss to Cronulla, Bennett was asked about winning the wooden spoon.\n\n“I knew someone would ask that question ... I’m not answering that, OK?,” Bennett said.\n\nWayne Bennett and partner Dale Cage have banned radio station Triple M after an inappropriate radio stunt. Credit: Instagram\n\nTriple M Brisbane presenters Greg Martin, Dan Anstey and Margaux Parker then decided to use that grab for their inappropriate stunt.\n\nIn the mock interview, Martin said: “Well, (Bennett) didn’t know I was about to enter the media room. I got there late ... I said, ‘Hey mate, remind me Wayne, ‘Why did you drop Wally from the Broncos?’.\n\nAnd then they hit the button on the soundbite: “I knew someone would ask that question.”\n\nThe prank then took a strange and personal twist.\n\nMartin said: “Why did you leave Trish, mate?”\n\nSoundbite: “I knew someone would ask that question.”\n\nMartin: “Darius (Boyd) and you ... I don’t understand that relationship.”\n\nSoundbite: “I knew someone would ask that question.”\n\nAnstey: “Is it true that you, Greg Martin from Triple M and Clint Eastwood are the exact same person Wayne?”\n\nSoundbite: “I knew someone would ask that question.”\n\nParker: “How big are Dale’s boobs, Wayne?”\n\nSoundbite: “I knew someone would ask that question.”\n\nThen someone says to Parker: “That’s ridiculous. That is so rude of you.”\n\nIt has been reported that Cage was listening to show when the prank went to air.\n\nIt is said she called network management to complain and Parker called Bennett after the show.\n\nParker is the wife of NRL great Corey Parker, who was coached by Bennett.\n\nBennett did not want to address the prank but called it personal.\n\n“That’s personal stuff, so I’m not going to go into that,” he told News Corp.\n\n“You talk to them (Triple M).\n\n“If they want to say something about their behaviour, you talk to them, but I’m not saying anything more.”\n\nSouths CEO Blake Solly called it a “private matter” for his coach to handle.\n\n“We understand it’s been dealt with,” Solly said.\n\n“Wayne has the club’s total support.”",
      "frequency": 1
    },
    {
      "topic": "sports",
      "title": "North Melbourne coach Alastair Clarkson responds as question about passion keeps surfacing",
      "author": "Unknown",
      "source": "7News",
      "url": "https://7news.com.au/sport/afl/north-melbourne-coach-alastair-clarkson-responds-as-question-about-passion-keeps-surfacing-c-19535247",
      "published": "2025-07-31T05:21:10+00:00",
      "content": "North Melbourne coach Alastair Clarkson has scoffed at the suggestion he has lost his passion as the struggling Kangaroos battle to the end of the AFL season.\n\nNow in his third season at Arden Street, Clarkson has a 10-1-44 record as coach, with a winning percentage of just 19.09.\n\nThe Kangaroos have lost five games on the bounce, including a 101-point hammering from Geelong.\n\nKnow the news with the 7NEWS app: Download today\n\nChannel 7 expert Kane Cornes has repeatedly wondered if Clarkson has lost his passion, pulling apart a recent media conference where he looked “defeated”.\n\n“I sat through his media conference twice after the game and maybe I’m harsh on coaches that face the media straight after the game, but he is as uninspiring as I’ve seen him,” Cornes said on The Agenda Setters.\n\n“And he looks as though he’s lost the passion.\n\nAlastair Clarkson has brushed off queries about his desire to continue as North Melbourne coach. Credit: AAP\n\n“So in eight minutes and one second, he said the word ‘um’ 70 times. He said it 70 times. I counted them. And it’s just the same monotonous (stuff).”\n\nBut Clarkson, a four-time premiership-winning coach at Hawthorn, brushed aside queries over his passion as he drew parallels between his time at North and his early days at the Hawks.\n\n“I wouldn’t have come back if I didn’t want to do this job,” Clarkson said on Thursday.\n\n“I love the challenge of it. It’s a significant challenge, but I don’t see it as any different to the challenge I had when I first arrived at Hawthorn: no senior coach, no CEO, political turmoil within the footy club, less than 25,000 members.\n\n“In a very, very quick space of time that club was able to turn itself around.\n\n“And I’m confident it can be done here as well, and I’m enjoying the challenge of it. It’s not easy — as they always say, if it was easy, everyone would be doing it.”\n\nClarkson was adamant the Kangaroos’ troubles weren’t his toughest, surprisingly pointing to the 2014 premiership-winning year at Hawthorn.\n\n“Geez, we confronted some adversity. I was out for six weeks with a serious illness. Some of our more senior players were missing 10, 12, 14 weeks of footy, and it was a really, really tough year,” he said.\n\n“Unbelievably rewarding that we ended up being able to, despite the adversity, win - but that’s what we’re searching for.\n\n“We know this game’s tough. Whether you’re a side that’s really, really good and challenging at the top end, it is still really, really tough.”\n\nIt gave Clarkson the belief that things could still turn at North.\n\n“As tough as it is, and it seems like, ‘well, gee, we’re being overly patient’, all of a sudden it will turn and the confidence of the group will rise,” he said.\n\n“And when that’s going to happen I don’t know, but sometimes it can happen really, really quickly.”\n\nClarkson conceded that could mean another pre-season, but stressed the Kangaroos still had “an enormous amount to gain” from their last four games.\n\nFirst up is St Kilda at Marvel Stadium on Sunday, including attempting to shut down in-form Saints gun Nasiah Wanganeen-Milera\n\nNorth will name spearhead Nick Larkey (knee) to play, but if he is a late withdrawal key defender Charlie Comben will likely swing forward again.\n\nGeorge Wardlaw could return at AFL level after gaining match conditioning via the VFL.",
      "frequency": 1
    },
    {
      "topic": "sports",
      "title": "Daisy Pearce pulled across to help West Coast men’s team",
      "author": "Unknown",
      "source": "7News",
      "url": "https://7news.com.au/sport/afl/daisy-pearce-pulled-across-to-help-west-coast-mens-team-c-19536279",
      "published": "2025-07-31T06:26:44+00:00",
      "content": "A priority pick won’t solve all of West Coast’s problems, and coach Andrew McQualter has revealed he will pick the brain of AFLW great Daisy Pearce in order to help the men’s program rebound from the lowest ebb in the club’s history.\n\nThe Eagles (1-18) have won just 11 games since the start of 2022, and will collect their second wooden spoon in the space of three years.\n\nGiven how dire the past four years have been, West Coast will formally ask the AFL for a priority pick.\n\nKnow the news with the 7NEWS app: Download today\n\nThat impending request has already attracted a wave of criticism from fans and experts, given West Coast won the flag in 2018 and reached the finals as recently as 2020.\n\nMcQualter has endured a tough debut year in the hot seat, and is desperate to fast-track the team’s rebuild.\n\nThe 39-year-old revealed on Thursday that part of his plan is to tap into the knowledge of AFLW trailblazer Pearce, who is West Coast’s women’s coach.\n\nAndrew McQualter is on the verge of a one-win first season in charge. Credit: Daniel Carson / AFL Photos\n\nPearce led the Eagles to a 4-7 record in her first year as coach — the best return for the club in its six-season AFLW history.\n\nThe 37-year-old previously served as a development coach with Geelong before landing the top role with the Eagles.\n\n“Daisy has finished her first year, added a second pre-season, and I will really look to use Daisy as a resource as to what she learned over that period,” McQualter said.\n\n“Just with where we’re at as a team and a club — we have to get better really quickly.\n\n“So if there’s something I can learn from Daisy coming into her second season as coach, I’ll look to learn it and implement it, because it’s going to be a really critical period for our club over the next six to 12 months.”\n\nPearce, who captained Melbourne to the 2022 AFLW flag during her glittering 55-game career, is eager to learn more from West Coast’s men’s program.\n\n“I’m really excited to work with ‘Mini’ over the next few years ... so that I can develop myself, help out however I can, and just keep bringing our programs closer and closer together,” Pearce said.\n\nMcQualter defended West Coast’s plea for a priority pick.\n\n“We’re just looking at it from the performances of the last four years and the history of what priority picks get given for,” McQualter said.\n\n“We think we qualify, so we’ve applied for it.\n\n“We’re in a rush to get better, and if it’s a way that we can get better, we’re willing to apply for it.”\n\nEven if they get knocked back, West Coast are still likely to have the first two picks in the national draft.\n\nPick No.1 will be for finishing last, while if restricted free agent Oscar Allen heads to Brisbane as expected, the Eagles will almost certainly be handed pick No.2 as compensation.\n\nWest Coast will be without Harley Reid (ankle) for the rest of the season, leaving them even more vulnerable for Saturday’s clash with Melbourne at Marvel Stadium.",
      "frequency": 1
    },
    {
      "topic": "sports",
      "title": "Meat thief hits sports club in Hervey Bay four times stashing haul in wheelie bin",
      "author": "Connor Alforque, Digital Staff",
      "source": "7News",
      "url": "https://7news.com.au/news/meat-thief-hits-sports-club-in-hervey-bay-four-times-stashing-haul-in-wheelie-bin-c-19445879",
      "published": "2025-07-23T02:58:06+00:00",
      "content": "Up to $8000 worth of meat has been stolen from a Queensland business after four break-ins over the past month, with fears stolen steak is making its way onto dinner plates.\n\nHervey Bay Sports Club believes the expensive beef is being sold by a cunning customer who has spent time eyeing the business at Torquay.\n\nWATCH THE VIDEO ABOVE: Sports club hit four times by meat thief.\n\nKnow the news with the 7NEWS app: Download today\n\nSecurity vision shows sparks flying during the most recent break-in, as a hooded intruder cut his way into an outdoor cold room using an angle grinder about 4.15am on Saturday.\n\nThe man then appeared to drag a wheelie bin into the fridge before rolling it away minutes later.\n\nThe same walk-in cooler first became the target of theft on June 8, when bolt cutters were used about 4.15am.\n\nAfter four minutes inside the fridge, the man can be seen zipping up his backpack and sprinting into the night.\n\nThe stolen items are estimated to be worth between $6000 and $8000, and include dry-aged rump, eye fillet, T-bone, ribs, sausages and pizza bases.\n\n“We believe he’s selling it. The quantity he’s taken, it’s very hard for one person or a group of people to eat the quantity,” club secretary and treasurer Les Marsh told 7NEWS.\n\nThe same walk-in cooler was targeted in four separate break-ins over the past month. Credit: 7NEWS\n\nSecurity cameras caught a hooded man breaking into the cold room with an angle grinder in the early hours. The alleged thief used a wheelie bin to transport the stolen meat. Credit: 7NEWS\n\nThe business has since moved its meat to other fridges and hired guards to patrol the property during the early hours of the morning.\n\nBut extra security hasn’t deterred the meat lover, who Marsh believes is behind all four break-ins.\n\n“I think it’s pathetic that you would come and take from a club that’s giving back to the community,” he said.\n\n“We have to create $60,000 or $80,000 worth of sales to cover that loss.”\n\nPolice collected what could be a crucial clue on Tuesday, finding hair entangled in a fence.\n\nThe thief remains on the run.",
      "frequency": 1
    },
    {
      "topic": "sports",
      "title": "He debuted on the world stage. Is this Yuin man the next rugby union star?",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/nitv/article/he-debuted-on-the-world-stage-is-this-yuin-man-the-next-rugby-union-star/d4uat5l21",
      "published": "2025-07-31T10:43:17.044884",
      "content": "Jarrah McLeod has his sights set on the green and gold of the Wallabies – and he's not far off.\n\n\n\n\n\nThe Yuin man was named in the inaugural First Nations & Pasifika XV team who faced off against the British & Irish Lions last week.\n\n\n\nREAD MORE Wallabies to sing in Yugambeh to honour trailblazer Lloyd McDermott\n\nHe came off the bench, at inside centre, dominating Lions captain Owen Farrell.\n\n\n\n\n\n\"It's been an exciting week,\" McLeod, 21, told NITV.\n\n\n\n\n\n\"I wasn't too stressed coming on the field, it was the day before – I was sitting in my room and sweating.\"\n\n\n\nJarrah McLeod of the First Nations & Pasifika poses with family following the tour match between First Nations & Pasifika v British & Irish Lions at Marvel Stadium on July 22, 2025 in Melbourne, Australia. Credit: Graham Denholm/Getty Images\n\nLeague to union\n\nGrowing up in Nowra on the NSW south coast, Jarrah was raised on rugby league.\n\n\n\n\n\nIn Year 8, he received a scholarship to attend Knox Grammar School in Sydney's north, where his rugby union career began.\n\n\n\n\n\nBut he still played league too, taking the field with La Perouse Panthers.\n\n\n\n\n\n\"Knox was where I got introduced to rugby union, I didn't know any of the rules, I had to learn on the spot,\" he laughed.\n\n\n\n\n\nHe was recruited by South Sydney Rabbitohs as part of their development side, and then moved across to Canterbury Bulldogs.\n\n\n\n\n\nBut, after the HSC and the structure of schooling fell away, Jarrah began to struggle.\n\n\n\n\n\n\"I wasn't caring about my body as much and I didn't get picked for a side. I was left without options and so had to have a think about what I wanted to do,\" he said.\n\n\n\nHe took a chance on union, heading to the ACT Brumbies Indigenous Pathways Program (IPP).\n\n\n\n\n\nIn the first three weeks he was injured, but the recovery process motivated him to look after himself and put footy first.\n\n\n\n\n\n\"I've been in Canberra ever since, trying to put my head down and focusing on footy,\" he said.\n\n\n\nMaking the big time\n\nOn Friday, ACT Brumbies announced their signing of Jarrah for two years. He'll represent the club in Super Rugby Aus and Super Rugby Pacific.\n\n\n\n\n\nBrumbies head coach Stephen Larkham said their eyes were on the youngster during the IPP and he used the Lions game to \"show the world just how good he is\".\n\n\n\n\n\n\"We're really looking forward to Jarrah joining us full-time next season,\" he said.\n\n\n\n\n\n\"He's an excellent ball carrier for someone of such a young age.\"\n\n\n\nJarrah said he's found a home with the Brumbies, particularly under the mentorship of teammate and Barunggam man Andrew Muirhead.\n\n\n\n\n\n\"I have a lot of people backing me, especially my family and the Brumbies community,\" he said.\n\n\n\n\n\n\"I was going through a stage where I was lazy, didn't want to go to training, sleeping in and missing morning gym. I had to get a talking to.\n\n\n\n\n\n\"Family have my back, they push me to keep doing my thing and Andy has always had my back, no matter what. He's like a little father to me, rips into me if I need to work on stuff.\"\n\n\n\nAndy Muirhead of the First Nations & Pasifika in action during the tour match between First Nations & Pasifika v British & Irish Lions at Marvel Stadium on July 22, 2025 in Melbourne, Australia. Credit: Jonathan DiMaggio/Getty Images Jarrah joins only a handful of other Indigenous men playing union. He thinks there's opportunity for many more.\n\n\n\n\n\n\"It's different to league, it's a different game and a lot of rules. But, it's backyard, eyes-up footy, which every single Indigenous boy knows how to play,\" he said.\n\n\n\n\n\n\"There's so much support in union, we want more Indigenous boys in the game. There is only like eight of us in the game.\"\n\n\n\n\n\nWith a big career ahead of him and undeniable talent, Jarrah remains humbled and dedicated, with his eyes firmly on the Wallabies jersey.\n\n\n\n\n\n\"I want to be successful at rugby union,\" he said.\n\n\n\n\n\n\"I want to make the Wallabies and be one of the best players in the game. I want to travel the world and showcase my mob and my family, make them proud.\"",
      "frequency": 1
    },
    {
      "topic": "sports",
      "title": "Tour de France Femmes: Your questions answered",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/sport/article/tour-de-france-femmes-your-questions-answered/7dffepg31",
      "published": "2025-07-31T10:43:17.970486",
      "content": "The place to watch the Tour de France Femmes is right here on SBS. Replays, mini stage recaps, extended highlights, winning moments and live streaming can be found on the SBS On Demand Tour de France Hub and the SBS Skoda Tour Tracker, available for download on iOS and Android from August 12 to 18.\n\n\n\nWhat is the Tour de France Femmes?\n\nThe Tour de France Femmes is an annual stage race primarily held in France and, in some cases, parts of other nations over an eight-day period.\n\n\n\n\n\nUnlike the men’s event, originally founded in 1903, a one-off event in 1955 was the first taste women would receive of the Tour, before several iterations followed between 1984 and 2009.\n\n\n\n\n\nFinancial difficulties, limited media coverage and issues with race organisers were just some of the roadblocks preventing the women’s equivalent from growing, which drew increased criticism from campaigners and the professional women’s peloton.\n\n\n\nBy 2014, a one to two-day event known as La Course by Le Tour de France was founded, with the week-long Tour de France Femmes then coming into effect in 2022.\n\n\n\n\n\nThe Tour is known as a ‘Grand Tour’, a term used to describe the most difficult events on the UCI Women’s World Tour calendar.\n\n\n\n\n\nThere are three Grand Tours in total; the other two being La Vuelta Femenina and the Giro d’Italia Women, and winning one instantly elevates the status of a rider and her team.\n\n\n\n\n\nIf you are just getting into the Tour de France Femmes at this point, or looking to get a friend in, why not take a look at our beginner's guide !\n\n\n\nHow long is the Tour de France Femmes?\n\nThe 2024 route will be run over 949 kilometres and includes 10,700 metres of vertical gain over the eight stages.\n\n\n\n\n\nRacing will take place in three countries, with the Grand Depart in Rotterdam, Netherlands, before the peloton journeys to Belgium and France.\n\n\n\n\n\nFour mountain ranges are set to feature, with the Ardennes, Vosges, Jura, and Alps set to deliver spectacular scenery and renowned difficulty associated with the Tour de France.\n\n\n\n\n\nThe winner of the Tour de France Femmes generally takes about 25-27 hours to complete the route, with victory margins more often in minutes despite the length of the event.\n\n\n\n\n\nStream free On Demand Tour de France Femmes 2023 series • cycling series • cycling\n\nHow many teams and riders are involved in the Tour de France Femmes 2024?\n\nA total of 22 teams, each with seven riders, will participate in the 2024 edition, with all 15 Women’s WorldTeams automatically invited alongside Continental Teams Cofidis Women Team and Tashkent City Women Professional Cycling Team. The remaining five Continental Teams were selected by the Amaury Sport Organisation (ASO).\n\n\n\nTeams:\n\n\n\nAG Insurance – Soudal Team\n\nArkea – B&B Hotels Women\n\nCanyon-SRAM Racing\n\nCeratizit – WNT Pro Cycling Team\n\nCofidis Women Team\n\nEF-Oatly-Cannondale\n\nFDJ-Suez\n\nFenix-Deceuninck\n\nHuman Powered Health\n\nLaboral Kutxa – Fundacion Euskadi\n\nLidl – Trek\n\nLiv AlUla Jayco\n\nLotto Dstny Ladies\n\nMovistar Team\n\nRoland\n\nSt Michel – Mavic-Auber93\n\nTashkent City Women Professional Cycling Team\n\nTeam DSM-Firmenich PostNL\n\nTeam SD Worx – Protime\n\nTeam Visma – Lease a Bike\n\nUAE Team ADQ\n\nUno-X Mobility\n\nHow do you win the Tour de France Femmes?\n\nThe rider with the lowest aggregate time across all eight stages will be crowned the winner of the general classification.\n\n\n\n\n\nThe general classification is the most sought-after and is rewarded with the famous yellow jersey, however, there are three other classifications on offer for the peloton: points, mountains, and best young rider.\n\n\n\n\n\nThe winner of each individual stage is the rider first across the finish line, and each stage win is a prestigious honour.\n\n\n\n\n\nHow the general classification works (What is the yellow jersey?):\n\n\n\n\n\nEvery stage is timed until the finish, with the rider with the lowest cumulative time to that point declared the overall leader and awarded a yellow jersey – the maillot jaune – that must be worn by the rider. The jersey is yellow in honour of the paper L’Auto would print its content on.\n\n\n\n\n\nWearing the yellow jersey gives one’s team and sponsors more publicity and motivates the individual to keep a hold of it for as long as possible.\n\n\n\nDemi Vollering of Team SD Worx - Protime celebrates as yellow jersey winner during the 2023 Tour de France Femmes. Source: Getty / Alex Broadway/Getty Images How the mountains classification works (What is the polka dot jersey?):\n\n\n\n\n\nDuring mountain stages, points are awarded to the rider who is first to reach the top of each significant climb on offer, with points also awarded to the next nine riders to complete the ascent.\n\n\n\n\n\nThe number of points awarded depends on the category of the climb, which can range from one, the hardest; to four, the easiest. In the case of the Tour, there are also the hors categories climbs, which are worth more points for being beyond categorisation and at high altitude.\n\n\n\n\n\nA rider with the most points at the end of a stage will have the honour of wearing the polka dot jersey the next day, one first introduced at the men's Tour in 1975 despite the classification’s presence in the race since 1933.\n\n\n\n\n\nHow the points classification works (What is the green jersey?):\n\n\n\n\n\nThis classification is generally won by the sprinters and sees points awarded based on a rider’s position at the end of a stage.\n\n\n\n\n\nStages are categorised into types and are awarded more points depending on their climbing difficulty; flatter stages are awarded more points to keep the competition for the jersey primarily among the sprinters.\n\n\n\n\n\nStages can also have one or more intermediate sprints scattered along its route, whereby points are awarded to the first 15 cyclists across its marked lines.\n\n\n\n\n\nA rider with the most points at the end of a stage will don the green jersey the next day, with the hope of preserving their advantage until the final podium.\n\n\n\nLotte Kopecky of SD Worx - Protime won the green jersey at the 2023 edition of the Tour de France Femmes. Source: Getty / Tim de Waele/Getty Images How the young rider classification works (What is the white jersey?):\n\n\n\n\n\nThis classification only applies to riders that will stay under the age of 23 in the calendar year, with the leader determined in the same way as the general classification.\n\n\n\n\n\nFirst introduced for the men in 1975, the white jersey has been available to eligible members of the peloton in every edition of the Tour aside from a 10-year hiatus between 1989 and 1999.\n\n\n\nWho won the GC title at the Tour de France Femmes last year?\n\nDemi Vollering won the second-ever edition of the women’s race in its current guise, defeating rival and defending champion Annemiek van Vleuten who ultimately finished in fourth position behind Kasia Niewiadoma and runner-up, Lotte Kopecky.\n\n\n\n\n\nThe SD Worx - Protime star took out the penultimate stage with a phenomenal performance on the Col du Tourmalet – enough to earn her the yellow jersey for the first time.\n\n\n\nREAD MORE Vollering wins the Tour de France Femmes\n\nWhen does 2024 Tour de France Femmes start?\n\nThe 2024 edition of the Tour will commence on August 12 and conclude on August 18.\n\n\n\nWho are the favourites for the 2024 Tour de France Femmes?\n\nA star-studded line-up of general classification contenders will contest this year’s French Grand Tour, with Demi Vollering determined to defend her overall title against the likes of Kasia Niewiadoma, Elisa Longo Borghini and Juliette Labous.\n\n\n\n\n\nNeve Bradbury, Sarah Gigante, Amanda Spratt and Grace Brown will be out to impact proceedings from an Australian perspective, with more riders still to be confirmed.\n\n\n\nIs every stage at the Tour de France Femmes the same?\n\nThe 2024 route features three flat stages, two hilly, one individual time trial and two mountain stages – the latter of which will conclude atop the famous Alpe d’Huez.\n\n\n\n\n\nStages:\n\n\n\nStage 1 on August 12: Rotterdam – La Haye = 123km – Flat\n\nStage 2 on August 13: Dordrecht – Rotterdam = 69.7km – Flat\n\nStage 3 on August 13: Rotterdam – Rotterdam = 6.3km – ITT\n\nStage 4 on August 14: Valkenburg – Liege = 122.7km – Hilly\n\nStage 5 on August 15: Bastogne – Amneville = 152.5km – Flat\n\nStage 6 on August 16: Remiremont – Morteau = 159.2km – Hilly\n\nStage 7 on August 17: Champagnole – Le Grand-Bornand – Mountain\n\nStage 8 on August 18: Le Grand Bornand – Alpe d’Huez – Mountain\n\nHow can Australians watch the 2024 Tour de France Femmes?\n\nAll eight stages of the 2024 Tour de France Femmes will be live-streamed on SBS On Demand, with live television coverage available on SBS at the same time each night.\n\n\n\n\n\nWith catch-up replays as well as extended highlights and analysis available throughout the week, SBS and SBS On Demand are the perfect places to keep up to date.",
      "frequency": 1
    },
    {
      "topic": "sports",
      "title": "SBS expands football offering with 24/7 FIFA+ channel",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/sport/fifa-world-cup-2026/article/sbs-expands-football-offering-with-24-7-fifa-channel/5ukyujxgb",
      "published": "2025-07-31T10:43:33.691079",
      "content": "You can watch all 104 games of the FIFA World Cup 2026™ LIVE, FREE and EXCLUSIVE on SBS, SBS VICELAND and SBS On Demand.\n\n\n\n\n\nIn addition to the Road to FIFA World Cup 26™ Hub , the FIFA+ channel will provide premium FIFA football content around the clock to Australian audiences - 24 hours a day, seven days a week - from both the men’s and women’s game right here .\n\n\n\nThe FIFA+ FAST channel will be available to SBS On Demand subscribers from November 2024. Source: SBS As the spiritual home of the world game, this new offering marks another step in SBS's ongoing commitment to making world-class football accessible to all Australians for free.\n\n\n\n\n\nViewers can look forward to watching unique documentaries, FIFA classic matches and more on the channel, an offering that will complement the existing CONMEBOL-based FIFA World Cup qualifiers and The Weekly Football Wrap already available via SBS On Demand.\n\n\n\n\n\nCheck out our FIFA+ content via our SBS On Demand TV guide here .\n\n\n\nREAD MORE How to watch FIFA World Cup 2026™ Qualifiers LIVE on SBS\n\n“We’re excited to bring the FIFA+ FAST (free ad-supported streaming TV) channel to SBS On Demand, giving Australians free access to world-class football content anytime, on any device,” said Ken Shipp, SBS Director of Sport.\n\n\n\n\n\n“SBS has been a long-standing and proud FIFA partner since first broadcasting the World Cup in 1986, and this channel lets us bring even more top-tier football to passionate fans.\n\n\n\n\n\n“It underscores our commitment to, and investment in, high-quality sports programming and expanding Australians' access to the beautiful game.”\n\n\n\nSBS will broadcast the 2026 edition of the World Cup in its entirety - live, free and exclusive - totalling 104 matches across the United States, Canada, and Mexico.\n\n\n\n\n\nBefore then, however, football fans can turn to SBS On Demand for their international football fix, with The Weekly Football Wrap covering everything else that takes place across the world of football.",
      "frequency": 1
    }
  ],
  "finance": [
    {
      "topic": "finance",
      "title": "Virgin Australia offers shoppers the chance to win return economy flights across the country",
      "author": "Holly Hampton-Thayers",
      "source": "7News",
      "url": "https://7news.com.au/best-picks/virgin-australia-offers-shoppers-the-chance-to-win-return-economy-flights-across-the-country-c-19536004",
      "published": "2025-07-31T07:36:30+00:00",
      "content": "Fancy a free holiday? You could be jet-setting across the country thanks to Virgin Australia’s latest competition.\n\nThe nation’s favourite airline is giving lucky Aussies the chance to win return domestic economy flights — by simply snapping a selfie.\n\nTo celebrate the newest crew member (and beloved mascot) Velocity the Lion, Virgin has launched a nationwide photo challenge.\n\nKnow the news with the 7NEWS app: Download today\n\nThe rules are straightforward, find Velocity the Lion, take a picture and share it on Instagram or TikTok tagging @virginaustralia and using the #SpotTheLion hashtag.\n\nYou’ve got until August 5 to locate Virgin’s furry friend, and he could be found anywhere from inside the airport terminal or lounge, or even onboard the plane.\n\nBut that’s not all your keeping an eye out for — Virgin Australia Cabin Crew are getting in on the fun, sporting their low mane-tenance ‘lion ears’ in and around terminals and during flights.\n\nHave your cameras at the ready: Velocity the Lion is hiding out in and around the terminal. Credit: Virgin Australia\n\nCelebrating Aussies favourite airline, Virgin Australia is giving back to their loyal Velocity members, offering the chance to win domestic return flights to any location across the country.\n\n“I might be the new kid in the cabin, but I’m here to make flying even more remarkable,” said Velocity the Lion.\n\n“Spot me, snap a pic, and tag @VirginAustralia to enter to win flights. After all, every journey should come with a little surprise and delight – and maybe even a roar!”Virgin Australia’s Chief Marketing Officer, Libby Minogue, added: “Velocity has well and truly become King of the Cabin – he’s taken over our social channels, hearts and camera rolls in record time. Fans are hunting him down in packs, with some stopping just short of a tackle to get that perfect selfie.”\n\nWinners will be announced on social media after each upcoming sport match, so keep a close eye on your DMs.\n\nVisit Virgin Australia to read the competition terms & conditions.\n\nKeep an eye out for Virgin Australia’s furry mascot every time you fly. Credit: Virgin Australia\n\nVirgin Australia is also set to be the first airline in the country to allow travellers to bring pets aboard the cabin on domestic flights.\n\nThe airline has just received the green light of approval from Food Standards Australia New Zealand (FSANZ) to carry small animals in the cabin.\n\nWhile there is yet to be specific rules in place for the upcoming service, Virgin Australia has confirmed that only small dogs and cats will be allowed onboard, on the basis that they fit comfortably in the approved pet carriers, and stowed under the seat in front for the whole flight.\n\nAiming to have the new service in place by the end of 2025, it could be a game-changer for those with furry friends.",
      "frequency": 1
    },
    {
      "topic": "finance",
      "title": "Finance",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/news/tag/section/finance",
      "published": "2025-07-31T10:43:11.523390",
      "content": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
      "frequency": 1
    },
    {
      "topic": "finance",
      "title": "SBS Small Business Secrets",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/news/small-business-secrets",
      "published": "2025-07-31T10:43:15.831632",
      "content": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
      "frequency": 1
    },
    {
      "topic": "finance",
      "title": "What this grieving daughter found online is helping thousands in Australia",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/news/small-business-secrets/article/what-this-grieving-daughter-found-online-is-helping-thousands-in-australia/1pz56yq42",
      "published": "2025-07-31T10:43:15.522115",
      "content": "This article contains references to death.\n\n\n\n\n\nIn a cosy apartment in Sydney, Vibha Gulati looks sadly at an old photograph, a cherished memory of her late mother, Bhushan.\n\n\n\n\n\n\"She was an amazing person. She was very compassionate, very loving,\" Ms Gulati said as she recalls people turned to her mother for advice, drawn by her wisdom and natural warmth.\n\n\n\n\n\nBoth migrants from India, Ms Gulati and her mother lived together in the city's west for 35 years, proud of their close bond.\n\n\n\n\n\n\"We were like sisters and we shared each other's thoughts and feelings. We could actually tune into each other on the same wavelength,\" she said.\n\n\n\n\n\nBut their strength was tested when her mother was diagnosed with ovarian cancer, and doctors said she had just six months to live.\n\n\n\n(Left to right) Prabha Gulati with her mother, Bhushan, and sister, Vibha. Source: Supplied / Vibha Gulati \"It was shocking, really shocking. I was losing my best friend! We loved each other very much and she's greatly missed,\" Ms Gulati said.\n\n\n\nFrom loss to healing\n\nAfter losing her mother to cancer, Ms Gulati turned to The Violet Initiative — a not-for-profit organisation, providing information and support to people in Australia to navigate the last stages of life and the grief that accompanies it.\n\n\n\n\n\n\"The [counselling] guide [at Violet] helped me to navigate the grief I was feeling,\" Ms Gulati said.\n\n\n\n\n\n\"The loss was so great and it came in waves. Often, I thought I was alright and then suddenly I would be crying.\n\n\n\n\n\n\"I felt the guide really understood and held the space [for me] and did not negate any feelings that I had.\"\n\n\n\nMs Gulati is not alone. In recent years, almost 30,000 people have utilised Violet and its national network of guides, along with a digital support service.\n\n\n\n\n\nViolet CEO Melissa Reader said: \"People come to us saying, 'I just do not know where to start'.\"\n\n\n\n\n\n\"A common theme is: 'My mum is in her late eighties, and dad died a couple of years ago. I'm the eldest daughter stepping into a caregiving role. I'm managing my own family and a career and I'm completely overwhelmed',\" she said.\n\n\n\n\n\n\"So [we] try to help families and communities be more prepared around the last stages of a person's life.\"\n\n\n\nViolet CEO Melissa Reader said the initiative aims to start conversations around end-of-life planning. Source: SBS / Spencer Austad As Australia's population ages, services like Violet are becoming increasingly crucial.\n\n\n\n\n\nMore than 180,000 Australians die each year, yet many leave behind no will or clear instructions about their end-of-life choices — forcing families to navigate both grief and complex legal processes.\n\n\n\n\n\n\"Up to 90 per cent of us want to be cared for at home for as long as possible with our family and our friends and everything that's familiar to us, and the right services and supports. But that is not what's playing out today,\" Reader said.\n\n\n\n\n\n\"We see people having at least four hospital admissions through the last 12 months, around 33 or 34 days, and we see one in two Australians dying in hospital. That is our least preferred place to die.\"\n\n\n\n\n\nA large number of public hospital beds are occupied by patients who are predominantly elderly and in their final year of life, according to a 2024 report by The Violet Initiative. It states caring for dying people in hospitals costs around $4 billion annually.\n\n\n\nReader said that figure is forecast to rise.\n\n\n\n\n\n\"We have about 12,000 people turning 85 each year today. In five years, that is forecast to increase fivefold to 60,000 people. And our health and age care systems are already at capacity,\" she said.\n\n\n\n\n\nReader's husband Mauro died of cancer aged just 39, leaving her to raise their three children alone. She understands how hard it can be to face critical care decisions.\n\n\n\n\n\n\"We were completely unprepared for Mauro's death. He died in intensive care and it was a very clinical and impersonal experience and quite frightening for all of us, including him,\" she said.\n\n\n\n\n\n\"I really needed help to know how to bring him into a conversation [about his illness] in a way that was okay that he could manage.\n\n\n\n\n\n\"Then, we could have done so much more together in the last six months of his life, with far fewer regrets for all of us.\"\n\n\n\nMelissa Reader (centre) with her late husband, Mauro, and their daughter, Mya. Source: Supplied / Melissa Reader\n\nTurning pain into purpose\n\nReader said her husband's sudden death — and the lack of preparedness to deal with the emotional aftermath — inspired her to expand services to ease burdens for others facing a similar situation.\n\n\n\n\n\nIn 2020, Reader relaunched an existing platform as Violet, a not-for-profit and social enterprise. The online resource aims to help more people navigate the end-of-life journey.\n\n\n\n\n\n\"Violet is the last colour of the day and the first colour of the dawn. So it's a really lovely reference to the passing of time,\" she explained.\n\n\n\n\n\n\"I don't think we can pretend to wave a magic wand and say everybody will have a death at home and it's going to be incredibly easy. This is not an easy stage of life. It's very complex, it's very emotional and there's a lot of uncertainty.\n\n\n\n\n\n\"However, we would like to help people stay in their homes for longer with the right services and support and help families prepare, if their loved one wants to die at home.\"\n\n\n\n\n\nFor those seeking support, Violet offers an initial free consultation, and services are then available via subscription.\n\n\n\nMitch Gibson is among Violet's 50 guides and is proud to provide personal care and support to grieving families.\n\n\n\n\n\nLike most Violet volunteers, she has struggled to cope with personal loss.\n\n\n\n\n\n\"I was trying to run my own small business, a yoga studio, and then my dad was diagnosed with dementia and my life partner, Mark, was diagnosed with stage four pancreatic cancer,\" she said.\n\n\n\n\n\n\"And to say that my world flipped upside down is an understatement.\"\n\n\n\n\n\nThat was 11 years ago, but for Gibson the memories remain vivid and the eventual loss of her partner led to a life-changing decision.\n\n\n\nMitch Gibson with her late partner Mark, who died of pancreatic cancer. Source: Supplied / Mitch Gibson \"I was only 56 years old, and I decided I wanted to work as a grief and bereavement counsellor and care for carers. As I had lived experience, Violet was an ideal choice,\" Gibson said.\n\n\n\n\n\n\"These are the conversations I want to be having. This is the help I want to be offering. I didn't ask for this to happen to me, but it did.\n\n\n\n\n\n\"I am someone who has cared [for a dying person], and someone who has grieved. So why not use that to help someone else?\"\n\n\n\n\n\nViolet also offers an AI-enabled digital companion that provides personalised support in multiple languages to people in need.\n\n\n\n\n\nYaniv Bernstein, Violet's chief product and technology officer, said: \"What we have is a really clever, voice-based artificial intelligence agent that talks to people in the manner of a normal conversation.\"\n\n\n\n\n\n\"People can have a conversation at any time, in many languages of their choice. And what they then get is a real assessment of where they're at, what stage they're in, what their needs are,\" Bernstein said.\n\n\n\n'This has to change'\n\nViolet chair Kate Carnell warns Australia is facing a looming crisis in how it handles death and dying. She said the country is dangerously unprepared — emotionally, socially and economically — for the realities of end-of-life care.\n\n\n\n\n\n\"We are sleepwalking into this century's biggest economic and social crisis. Research indicates that eight to 11 per cent of Australia's total health budget is spent on people in their final stage of life,\" she said.\n\n\n\n\n\n\"As well, only 14 per cent of Australians have a plan in place for the end of life. This has to change!\n\n\n\n\n\n\"Digital technology plays an important role in making services and information available to all Australians when they need it 24/7. And that's what Violet is providing.\"\n\n\n\nA portrait of Vibha Gulati's mother Bhushan, prior to her death. Source: SBS / Spencer Austad Ms Gulati and her mother were among the few to carefully plan for the end of life.\n\n\n\n\n\nAfter her diagnosis, Bhushan refused medical treatment and chose voluntary assisted dying (VAD) at home in the care of her daughters, Prabha and Vibha.\n\n\n\n\n\n\"It was important for her. She opted for VAD because she wanted control over her death and the whole process of her illness,\" Ms Gulati said.\n\n\n\n\n\n\"She did not want any chemotherapy or radiation. Surgery was an option, but that was also refused.\n\n\n\n\n\n\"She managed herself quite well. She was ill during the final week and could not lift herself up from the bed. But until the week she passed away, my mother was going out to cafes and restaurants.\"\n\n\n\n\n\nMs Gulati said faith — a mix of Buddhist, Hindu and spiritual beliefs — helped the family respectfully bid farewell to her mother in December last year.\n\n\n\n\n\n\"We had chanting here while she was passing away. We did Indian mantras infused with spiritual energy,\" she said.\n\n\n\n\n\n\"It helped her to transition more smoothly and it also created a very calming effect on the mind and on the emotions. So, it works for the people involved and the person who's passing away too.\"\n\n\n\nVibha Gulati is still learning to cope with grief after losing her mother. Source: SBS / Spencer Austad While faith has helped Ms Gulati navigate grief, she said the loss remains painful and hard to bear.\n\n\n\n\n\n\"I can feel her presence around me sometimes. So, it's really, really lovely. But that loss is still there and it takes a long time to adjust to,\" she said.\n\n\n\n\n\n\"However, my spiritual belief gives me strength and gives me trust that I will meet her again and that she has not gone forever.\"\n\n\n\n\n\nSupport is available through LifeLine on 13 11 14 or Griefline which provides confidential support on 1300 845 745 and via griefline.org.au",
      "frequency": 1
    },
    {
      "topic": "finance",
      "title": "'Maybe 100 texts, no answer': A Melbourne mum's worst fear as conflict rocked Iran",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/news/small-business-secrets/article/a-mothers-anguish-the-terrifying-wait-for-news-from-a-war-zone/eqvvgk7y5",
      "published": "2025-07-31T10:43:16.023995",
      "content": "Nayran Tabiei says this past week has been one of the worst of her life — and for someone who's already endured war, separation and heartbreak, that speaks volumes.\n\n\n\n\n\nA mother of four, who runs a busy catering business in Melbourne, Tabiei has spent recent days gripped by a single paralysing fear that her three sons in Tehran may not be alive.\n\n\n\n\n\nAs bombs pounded in and around the Iranian capital, she had no way of knowing if they had survived the chaos.\n\n\n\n\n\n\"The mobiles and internet were cut, so I had no news. And then my heart started to beat. I didn't sleep at all for one week,\" she said.\n\n\n\n\n\n\"I tried every night, every day, to message. If you see my mobile, there are maybe 100 messages there. But no answer, no answer.\"\n\n\n\nNayran Tabiei runs a catering business in Melbourne. Source: SBS / Scott Cardwell\n\nA family's journey of separation and survival\n\nTabiei fled conflict in her homeland, Syria, in 2012 with her husband, Majid and five-year-old daughter making the agonising decision to leave her three sons behind with their grandmother in Tehran.\n\n\n\n\n\nThe family initially sought refuge in Lebanon, then moved to Southeast Asia before taking the \"life-changing decision\" to risk the long and perilous journey to Australia by sea.\n\n\n\n\n\n\"When the boat capsized, we almost died. I held my daughter to my chest for five days and nights until we arrived at Christmas Island,\" she said.\n\n\n\n\n\nTabiei recalled her sons were kids at the time. She thought the separation would be temporary. But 14 years later, her sons are now aged 28, 26 and 22. She still hasn't seen them in person.\n\n\n\n\n\nThe only connection is via video calls — until last week, when even that lifeline was severed.\n\n\n\n\n\n\"As a mum, I made a bad decision and I feel so sad about it,\" she said. \"Now I cannot believe so many years have passed.\n\n\n\n\n\n\"They have grown up without me being beside them.\"\n\n\n\nOn 13 June, Israel attacked nuclear and military sites in Iran, claiming Iran was close to building a nuclear weapon, something Iran denies.\n\n\n\n\n\nIn response, both Iran and Israel traded missile strikes, escalating tensions rapidly across the region.\n\n\n\n\n\nThe United States later joined the conflict, dropping its so-called bunker buster bombs on the Iranian nuclear sites.\n\n\n\n\n\nAlthough a ceasefire has since been reached between the two countries, the situation remains fragile.\n\n\n\n\n\nAmid the unrest, many families like Tabiei's faced an agonising silence. With no way of contacting her children in Tehran, the pain of separation grew heavier by the day.\n\n\n\n\n\n\"I was boiling from inside because there was nothing I could do. But I want to help, to do something,\" she said.\n\n\n\nThen, just days ago, the call she had been praying for finally came. Her sons had survived.\n\n\n\n\n\n\"I'll have a good night's sleep now because my boys called me. My heart is beating so fast, it is so good,\" she said.\n\n\n\n\n\n\"They are staying in the mountains, in a room with their friends. I am so relieved. Thank God because I cannot imagine if they were not alive! Thank God.\"\n\n\n\n\n\nOver the years, Tabiei has built a life of quiet strength in Melbourne.\n\n\n\n\n\nShe trained in community service and childcare and eventually started her own small café, Flavours of Syria, in the beachside suburb of St Kilda.\n\n\n\n\n\nShe also devoted a significant amount of time to volunteering for displaced migrants and asylum seekers.\n\n\n\n\n\n\"I [have] trained hundreds and hundreds of asylum seekers. Many started a new business and could then stand on their own two feet,\" she said.\n\n\n\nNayran Tabiei closed the doors of her St Kilda cafe after operating it for six years. Source: SBS / Sandra Fulloon But the pain of being separated from her sons has never left her. For more than a decade, she has fought tirelessly to bring them to safety in Australia, but each attempt has ended in heartbreak.\n\n\n\n\n\n\"I hired lawyers and sent so many emails, but still I cannot reach Prime Minister [Anthony] Albanese, to tell him 'I'm a human being and a mum and I need help from the government'. I don't have any chance, my boys are there and I'm staying here,\" she said.\n\n\n\nSmall businesses struggle to survive\n\nAs if that weren't enough, the weight of rising costs forced her to shut down her café last month.\n\n\n\n\n\n\"It is too hard to earn enough to pay the rent,\" she said.\n\n\n\n\n\n\"Before, we had plenty of staff in the kitchen, but now I cannot afford to hire staff and buy food and pay the bills.\"\n\n\n\n\n\nTabiei is not alone. Recent data from credit reporting agency CreditorWatch shows 10 per cent of all Australian hospitality businesses have shut down over the past year.\n\n\n\n\n\nCreditorWatch CEO Patrick Coghlan said: \"Small businesses are being hit from all sides.\"\n\n\n\nCreditorWatch CEO Patrick Coghlan said hospitality businesses are being hit from all sides. Source: Supplied / CreditorWatch \"Obviously, consumer discretionary spending is down, yet the cost of labour and goods is increasing. So really it is a very challenging time,\" Coghlan said.\n\n\n\n\n\nLuke Achterstraat, CEO of Council of Small Business Organisations Australia (COSBOA), said the changes to award rates, set to take effect next week, will add to the growing pressures on small businesses.\n\n\n\n\n\n\"As of 1 July, the award rate goes up 3.5 per cent. The super guarantee increases by 0.5 per cent. So that's 4 per cent already on the wage stack. And on top of that, you have payroll tax,\" he said.\n\n\n\n\n\nCOSBOA is calling for more support to help small businesses survive.\n\n\n\n\n\n\"It is the toughest operating environment in recent memory for small businesses,\" Achterstraat said.\n\n\n\nLuke Achterstraat, CEO of Council of Small Business Organisations Australia, said urgent policy changes are required to help small businesses stay afloat amid mounting challenges. Source: SBS / Scott Cardwell \"And it is a wake-up call to policymakers to put in place policies that back our small businesses,\" he added.\n\n\n\n\n\n\n\n\"For a small business with revenue of up to $20 million a year, we are calling for the corporate tax rate to be slashed from 25 per cent to 20 per cent.\"\n\n\n\n\n\nInflation is easing, finally. The overall monthly Consumer Price Index (CPI) indicator rose 2.1 per cent in the 12 months to May 2025, slowing from a 2.4 per cent rise in the year to April.\n\n\n\n\n\nThis was the lowest figure since October last year, according to the latest data from the Australian Bureau of Statistics (ABS).\n\n\n\n\n\nCoghlan said it brings fresh hope of further interest rate relief for Australia's 2.5 million small business owners.\n\n\n\n\n\n\"The Reserve Bank has cut rates already, and that is the biggest driver of economic activity and spending both in the consumer and commercial sectors,\" he said.\n\n\n\n\n\n\"And we expect a couple more rate cuts this year, as well. So, the trend is certainly heading in the right direction.\"\n\n\n\nNayran Tabiei is focussed on her catering business after her café was forced to shut down. Source: SBS / Scott Cardwell While a potential rate cut could bring relief to some small business owners, it's already too late for Tabiei, who was forced to close down her cafe.\n\n\n\n\n\nShe is now concentrating on catering, which has lower running costs and helps keep her occupied, easing the emotional weight of being separated from her children.\n\n\n\n\n\n\"Really, I make all my food with my heart. And when you taste it, you will notice the love in it,\" she said.\n\n\n\n\n\n\"For me, it is all about sharing my culture with love.\"\n\n\n\n\n\nThis story was produced in collaboration with SBS Arabic.",
      "frequency": 1
    },
    {
      "topic": "finance",
      "title": "SBS On the Money",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/news/podcast/sbs-on-the-money",
      "published": "2025-07-31T10:43:18.491305",
      "content": "Get SBS News daily and direct to your Inbox Sign up now for the latest news from Australia and around the world direct to your inbox.\n\nYour email address * Morning (Mon–Fri) Afternoon (Mon–Fri) Weekend Subscribe By subscribing, you agree to SBS’s terms of service and privacy policy including receiving email updates from SBS.",
      "frequency": 1
    }
  ],
  "lifestyle": [
    {
      "topic": "lifestyle",
      "title": "New Brisbane flight path maps reveal how your suburb could be affected",
      "author": "Unknown",
      "source": "7News",
      "url": "https://7news.com.au/travel/air-aviation/new-brisbane-flight-path-maps-reveal-how-your-suburb-could-be-affected--c-19372835",
      "published": "2025-07-16T04:25:49+00:00",
      "content": "New flight paths over Brisbane have been released as part of a major plan to tackle aircraft noise.\n\nAirservices Australia has released a fresh report showing new preferred flight path maps aimed at reducing the impact of aircraft noise on suburbs worst affected since the opening of the city’s new parallel runway in July 2020.\n\nSince then, residents in the inner east, south and northwest have particularly reported intense aircraft traffic, with some homes being affected by dozens of low-flying planes each day.\n\nKnow the news with the 7NEWS app: Download today\n\nThe new proposal was designed to distribute flights more evenly across a wider area, thereby alleviating the pressure on suburban areas affected by arrivals and departures during the day and at night.\n\n“We are listening to residents who’ve consistently called for fairer distribution of aircraft noise,” Airservices head of community engagement Donna Marshall said.\n\n“Community feedback has already helped shape a number of preferred options.\n\n“We’re eager to speak to as many people as possible before final decisions are made.”\n\nDaytime arrivals and departures\n\nThe updated flight paths will redistribute approximately 20 per cent to 30 per cent of arrivals and departures to new routes over less populated areas, including increased use of Moreton Bay for approaches and departures.\n\nNew departure paths will encourage aircraft to fly over industrial zones and waterways more often, reducing the number of flights passing directly over residential areas during daytime hours, the proposal showed.\n\nThe changes are designed to accommodate growth in air traffic while addressing community concerns raised in previous consultation phases, which reported more than 1,000 submissions regarding noise impacts, Airservices said.\n\nNight departures and noise management\n\nNight departures are a major source of complaints, due to the low altitude of aircraft immediately after takeoff.\n\nSince the opening of the new runway, most night departures — approximately 85 per cent — use the runway aligned over Moreton Bay to minimise noise over residential areas.\n\nHowever, on average about 30 aircraft still depart over land between 10pm and 6am, mainly when the legacy runway is in use or during emergencies, the report shows.\n\nA new trial planned for mid-2026 proposes a departure path where aircraft will make a tight left turn shortly after takeoff, flying over industrial land and Moreton Bay to reduce noise impacts on nearby homes.\n\nThis new procedure would affect roughly 3,500 flights annually at night and could reduce noise disturbance for more than 20,000 residents currently affected by night flights over land.\n\nProposed night departure paths at Brisbane Airport aim to reduce noise over residential areas. Credit: Airservices Australia\n\nAccording to Airservices, simulations with major aircraft types — including the Airbus A320, A330, A350, A380 and Boeing 737-800 and 777 — showed they can generally follow the preferred flight path accurately.\n\nThe planes stayed on or within the centreline until over water, with only minor variations expected depending on conditions.\n\nAlthough many assume planes could always take off over Moreton Bay to avoid flying over homes, Airservices noted that’s not always possible.\n\nFor safety, aircraft must take off into the wind.\n\nWhen winds are blowing from the south, pilots are required to depart over land using the northern end of the runway.\n\nHave your say\n\nAirservices Australia encourages Brisbane residents to get involved and share their views on the proposed flight path changes.\n\nCommunity engagement sessions will be held across Brisbane from July 19 to 31, allowing locals to speak directly with flight path designers. Bookings are essential.\n\nResidents can also provide feedback online, by email or in writing, with submissions closing August 17.\n\nTo view the maps and submit feedback, visit engage.airservicesaustralia.com/nap4b.",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Latest podcasts from 7NEWS Australia, The Lady Vanishes and Shot In The Dark",
      "author": "Unknown",
      "source": "7News",
      "url": "https://7news.com.au/podcasts/really-mental-with-will-hyde-and-harrison-kennedy-c-12371320?utm_source=7news-homepage&utm_medium=tile&utm_campaign=rm-podcast",
      "published": "2025-07-31T10:42:50.101716",
      "content": "Ex-coroner’s bombshell revelations over mum’s death A retired senior coroner believes Amy Wensley was the victim of an unlawful killing and says there is evidence which shows she did not pull the trigger despite initial police beliefs.\n\n3 min read",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Logies beauty secrets revealed: The must-have items the stars are using ahead of TV’s night of nights",
      "author": "Unknown",
      "source": "7News",
      "url": "https://7news.com.au/best-picks/logies-beauty-secrets-revealed-the-must-have-items-the-stars-are-using-ahead-of-tvs-night-of-nights-c-19535527",
      "published": "2025-07-31T06:40:45+00:00",
      "content": "It’s the glitziest night on the Aussie TV calendar, and it’s all happening this Sunday on Channel Seven.\n\nThe 65th Annual TV Week Logie Awards are returning to Sydney, taking over The Star on Sunday, August 3, and Australia’s biggest stars are getting red carpet-ready with a little help from their stylists, make-up artists and hairdressers.\n\nAnd while there are a host of expensive products that many of them will swear by, not everything that makes them look good costs an arm and a leg.\n\nKnow the news with the 7NEWS app: Download today\n\nIn fact, some will set you back as little as $14.99 on Amazon Australia.\n\nWe’ve got the inside scoop on what the stars are using, so you can recreate Logies-worthy glam from home — minus the hair and makeup team.\n\nYou’re welcome.\n\n1. NYX Professional Makeup The Face Glue Setting Spray, $14.99\n\nA must for keeping your makeup fresh under those unforgiving red carpet lights, this setting spray is waterproof, transfer-resistant and flake-free.\n\nIt locks everything in place without adding extra shine.\n\nA few spritzes and your glam is sorted for the night — or at least until the afterparty.\n\nNYX Professional Makeup The Face Glue Setting Spray, $14.99 Credit: Amazon Australia\n\n2. Lancôme Teint Idôle Ultra Wear Foundation, $83\n\nThere’s a reason this foundation is a backstage staple.\n\nThe full coverage is buildable and breathable, so you can wear it from morning media calls through to the last glass of bubbles.\n\nIt’s also transfer-proof, which means no awkward foundation marks on suit lapels or evening gowns.\n\nCeleb-approved and worth every cent.\n\nLancôme Teint Idôle Ultra Wear Foundation, $83. Credit: Lancôme\n\n3. ghd Duet Style 2-in-1 Hair Dryer and Hair Straightener, $469\n\nHalf hair tool, half magic wand, this ghd multitasker lets stylists blow-dry and straighten in one go — a total time-saver before hitting the red carpet.\n\nRumour has it it’s even been used to smooth lapel creases in a pinch. Handy.\n\nghd Duet Style 2-in-1 Hair Dryer and Hair Straightener, $469 Credit: ghd\n\n4. Snail Mucin Serum for Face, $23.99\n\nYes, it sounds weird. No, it’s not a gimmick.\n\nThis cult-fave K-beauty serum is packed with 96 per cent snail secretion filtrate and has become a go-to for stars chasing that glass-skin glow.\n\nIt hydrates, plumps, and helps reduce fine lines — think of it as an overnight miracle in a bottle.\n\nSnail Mucin Serum for Face, $23.99. Credit: TikTok\n\n5. Jojoba Cold Pressed Natural Oil, $59.95\n\nThis one’s a triple threat. Hair? Tick. Face? Tick. Body? Tick.\n\nWith vitamins A, D, E and omegas galore, it’s the last-minute glow-up essential for stars showing a little skin (we see you, thigh-high slits).\n\nBonus: it absorbs quickly and won’t leave you looking greasy.\n\nJojoba Cold Pressed Natural Oil, $59.95. Credit: Instagram\n\n6. CLUTCH Glue (Liquid Fashion Glue), $29\n\nForget safety pins or awkward strips of boob tape.\n\nThis genius liquid adhesive keeps clothes exactly where they should be.\n\nIt’s the red carpet insurance policy every stylist swears by — perfect for plunging necklines, thigh splits or anything that’s got a mind of its own.\n\nCLUTCH Glue (Liquid Fashion Glue), $29 Credit: Instagram\n\nWhether you’re prepping for your own big night out or just want to know how the stars keep their glam intact, these are the products worth adding to cart.\n\nThanks to Amazon Australia, they’re just a few clicks away — no VIP invite required.\n\nDon’t miss the 2025 TV WEEK Logie Awards, airing live this Sunday at 7 pm on Channel Seven.",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Study links ultra processed foods and lung cancer",
      "author": "Unknown",
      "source": "7News",
      "url": "https://7news.com.au/news/study-links-ultra-processed-foods-and-lung-cancer-c-19521804",
      "published": "2025-07-30T08:34:20+00:00",
      "content": "Academics have found a link between consuming high levels of ultra processed foods (UPFs) and lung cancer.\n\nAn international team of researchers tracked the health and food habits of more than 100,000 US adults, with an average age of 63.\n\nAfter an average of 12 years the team identified 1706 cases of lung cancer.\n\nKnow the news with the 7NEWS app: Download today\n\nThe food survey questionnaires revealed consumption of UPFs, including ice cream, fried foods, bread, cakes, pastries, salty snacks, breakfast cereals, instant noodles, soups, margarine, confectionery, soft drinks, sweetened fruit drinks, hamburgers, hot dogs, and pizza.\n\nThe research team, led by academics in China, found that average UPF consumption was nearly three servings a day, but ranged from 0.5 to six.\n\nThe three types of food that featured the most were lunch meat and soft drinks.\n\nPeople who consumed the highest amounts of UPFs were 41 per cent more likely to develop lung cancer compared with those who consumed the least amount, academics wrote in the journal Thorax.\n\nThey found an increased risk found for both non small cell lung cancer and small cell lung cancer.\n\nThe authors said they did make adjustments to their findings based on whether or not people smoked but they did not make adjustments for smoking intensity, which may have an impact.\n\nThey stressed that “causality cannot be determined” from their findings and the data should be interpreted with caution.\n\n“Although additional research in other populations and settings is warranted, these findings suggest the healthy benefits of limiting UPF,” the authors said.\n\n“Limiting trends of UPF intake globally could contribute to reducing the burden of lung cancer.”\n\nCommenting on the study, Sam Hare, a chest radiologist at the Royal Free London NHS Trust, said: “A quarter of lung cancer cases occur in non-smokers so we do need research exploring whether other factors are associated with lung cancer.\n\n“We also know immunity is linked to cancer biology so it is a good idea to do research into factors like diet,” Professor Hare said.\n\n“However, further work is needed to establish direct causation between UPFs and lung cancer, crucially, whilst the study does make some adjustments for smoking status, the amount of smoking is not factored in, which is known to be directly related to lung cancer development.\n\n“Dietary habits also change considerably over the course of such long-term studies, as such, it is difficult to directly conclude that lung cancer is related to the level of UPF consumption alone given it was only declared at the start of the study.\n\nProf Hare added that evidence-based advancement in the early diagnosis of lung cancer in non-smokers was needed but “this study isn’t quite able to give us the answers yet”.",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Fast food giants eye Australian consumers as pretzel empire opens its first local store",
      "author": "Lauren Thomson",
      "source": "7News",
      "url": "https://7news.com.au/news/fast-food-giants-eye-australian-consumers-as-pretzel-empire-opens-its-first-local-store--c-19450402",
      "published": "2025-07-23T14:15:24+00:00",
      "content": "A proud American institution has opened its doors for the first time in Australia, offering something a little different to most US fast food empires.\n\nAuntie Anne’s famous pretzels, hotdogs and ice cream delights will be available to Sydneysiders from Saturday, with the first store opening its doors at Westfield Parramatta.\n\nAnd it isn’t likely to be the only one, with Popeyes, Jollibee and Firehouse Subs looking for store locations to bring over their popular goods for Australian consumers.\n\nKnow the news with the 7NEWS app: Download today\n\nAuntie Anne’s was started in 1988 when founder Anne Beiler bought a stand in a Pennsylvania farmer’s market. She started baking pretzels to help fund her husband’s desire to provide free family counselling services for their community.\n\nHer husband’s dream ultimately came true with the popularity of the now-international pretzels.\n\nA few US food giants are planning to come Australia. Credit: Auntie Anne’s/AAP\n\nExecutive Director of Food, Beverage and Agribusiness Insights at ANZ, Michael Whitehead, isn’t surprised by the interest of the US fast-food chains.\n\n“Australians cannot get enough chicken in our fast-food restaurant — it has become the dominant meat,” he told 7NEWS.\n\n“We will see people flocking to it — trying it — and people from all demographics.”\n\nPopeyes chicken, which is known for its “mouth-watering crunch and juicy fried chicken bursting with Louisiana flavour”, is planning to rival Australian favourite, KFC.\n\nRed Rooster, Oporto and KFC currently dominate Australia’s takeaway chicken market.\n\nPopeyes’ potential expansion to the local market would be the latest US venture to hit Australian shores, following the likes of Wendy’s, In-N-Out Burger and Chuck E. Cheese.\n\nCurrently, there is no information about where or when Popeyes is planning to open.\n\nPopeye is looking at store location in Australia Credit: Wikipedia\n\nPopular chain Jollibee is also planning to open in Sydney, with a potential location in Campbelltown according to Delicious.\n\nThe Filipino fast-food giant offers burgers, named Yumburgers, with chicken. But something never offered by a fast-food giant before is its ready-to-eat spaghetti.\n\nJollibee, the top fast-food chain in the Phillipines, opened its first restaurant in the United States in 1998. Credit: PA BEN / AAP\n\nSandwich king Firehouse Subs, meanwhile, is blazing a trail into Australia with plans to open 165 locations across the country over the next decade.\n\nThe first restaurant will open in south-east Queensland in late 2025, marking the start of the brand’s ambitious expansion into the Australian market.",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Worried about Alzheimer’s? Avoiding the disease could be a walk in the park",
      "author": "Unknown",
      "source": "7News",
      "url": "https://7news.com.au/lifestyle/worried-about-alzheimers-start-walking-according-to-a-new-10-year-study-c-19516648",
      "published": "2025-07-29T15:06:47+00:00",
      "content": "If you needed another reason to get your daily steps in, science just handed you one.\n\nA new study shows that walking daily can reduce the risk of cognitive decline — especially among those with a genetic predisposition for Alzheimer’s disease.\n\nAlmost 3000 participants between the ages of 70 and 79 reported their daily walking habits over the course of 10 years, according to research presented on Tuesday at the annual Alzheimer’s Association International Conference. Those who reported maintaining or increasing their walking habits over the years showed greater improvements in processing speed and executive function.\n\nKnow the news with the 7NEWS app: Download today\n\nThe benefits of walking were especially noticeable among those with a genetic predisposition for developing Alzheimer’s disease, according to the preprint, which has not been peer-reviewed or published in a professional journal.\n\n“We know sedentary behaviour increases as you get older, and physical activity decreases,” said senior study author Cindy Barha, an assistant professor of kinesiology at the University of Calgary in Alberta. “So we recommend reducing your sedentary behaviour by introducing small bouts of walking in between those times you have to be sitting down.”\n\nHow does Alzheimer’s disease work?\n\nAlzheimer’s disease is a severe form of dementia thought to be caused by a build-up of harmful plaques in the brain that interfere with how the nerve cells communicate, eventually leading to their death, Barha said.\n\nAs more nerve cells die, people with Alzheimer’s can develop progressive memory loss, confusion, personality changes and physical decline. Eventually, the disease can be fatal, and there is no known cure.\n\nGenetics are thought to play a major role in the disease. Specifically, genotypes called APOE affect the metabolism of plaque and other fats throughout the bloodstream. One specific kind, APOE4, is known to make it harder for the brain to clear the plaques and is linked to a higher risk of cognitive decline.\n\nAbout 15 to 25 per cent of people have this version of the APOE gene, and the only way to find out is from a genetic test, according to data from the US National Institutes of Health.\n\nThe mind-body connection\n\nAlthough the new study did not test a uniform walking regimen, Barha suggests walking multiple times daily to break up sedentary behaviour and maintaining consistent walking habits year to year to prevent cognitive decline.\n\n“More research is really needed to determine how many steps that really takes, but more is definitely going to be better,” she said. “The next steps would be to actually try to figure out the minimum amount of walking for different subgroups, (such as) females versus males, APOE4 carriers versus non-carriers.”\n\nA 2022 study found that even people who walked about 3800 steps per day at any speed cut their risk of dementia by 25 per cent.\n\nWhat might be going on between the brain and the rest of the body? Experts have several theories.\n\nFor one, regular exercise has been shown to help the body produce more of a protein called brain-derived neurotrophic factor, or BDNF, which is like fertiliser for your brain, helping it grow more cells and form new connections, Barha explained.\n\n“We’re thinking there’s proteins released from the muscle that travel to the brain and, either across the blood-brain barrier or at the blood-brain barrier, start a reaction that eventually leads to increases in BDNF within the brain,” she said.\n\nAnother theory is that exercise reduces neuroinflammation, a common symptom of Alzheimer’s disease.\n\nThe brain sends immune cells called microglia to attack plaque build-up, but this can backfire, explained Christiane Wrann, an associate professor of medicine at the Cardiovascular Research Center at Massachusetts General Hospital and Harvard Medical School. Chronic inflammation can lead microglia to begin attacking healthy brain cells as well, damaging the brain’s connections.\n\n“If you exercise, you actually strengthen the gene expression program that microglia need to function properly,” Wrann said.\n\nDoes greater risk mean greater reward?\n\nThe researchers were surprised to find that walking provided the greatest benefit to those with the APOE4 gene compared to those without it. To understand why this is, more research will be needed — but Barha has a theory.\n\n“Before the study started, we think APOE4 carriers had more room to grow in terms of cognition, since they may already have been experiencing some cognitive decline,” she said. “They also have more room to show improvement.”\n\nIt’s possible that the study itself also motivated participants with APOE4 genes to walk more than they had been beforehand, slowing their rate of decline.\n\n“This is a very strong example (that) it’s never too late to start exercising,” Wrann said. “Every step counts, and it’s much better to do an exercise regimen that you actually like, that you can actually stick to.”",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Dietitian Dr Kyla Smith says fish fingers, bread and ketchup is ‘nutritional’ and enough for children to get what they need",
      "author": "Unknown",
      "source": "7News",
      "url": "https://7news.com.au/lifestyle/health-wellbeing/dietitian-dr-kyla-smith-says-fish-fingers-bread-and-ketchup-is-nutritional-and-enough-for-children-to-get-what-they-need-c-19470575",
      "published": "2025-07-26T21:15:30+00:00",
      "content": "Paediatric dietitian Dr Kyla Smith has divided opinion after suggesting a picture of fish fingers, buttered bread and ketchup is nutritious enough for an every-day kids’ meal.\n\nThe Perth-based paediatric dietitian regularly shares posts detailing the nutritional content of food in a bid to educate parents.\n\n“It doesn’t have to be fancy. Even if your child is deep in the beige stage, they are still getting enough,” she wrote.\n\nKnow the news with the 7NEWS app: Download today\n\nSmith said she wants parents to feel confident their children are consuming a balanced diet with a variety of foods, which is what they need for their growth and development.\n\nHer post was part of a series where she features regular supermarket food and highlights the meals nutritional value.\n\nDr Kyla Smith broke down the nutritional value of meal, based on the average daily needs of a four to eight-year-old. Credit: Instagram\n\nBut the particular combination of foods in her post sparked an online debate.\n\nMany followers commented Smith’s suggestion was normalising processed food with high sugar content.\n\n“It’s really easy to throw criticism at people but in today’s world, it’s so hard to be a parent,” Smith told 7NEWS.com.au.\n\n“There are a lot of companies out there selling potions and powders, preying on the parents who believe their child isn’t getting enough nutrients.”\n\nSmith helps families sort through the misinformation with her tailored mealtime programs for every stage of the feeding process.\n\n“I’m not recommending to serve your child fish fingers every night for dinner,” Smith said.\n\n“The point of the post was to highlight that eating these types of foods as part of a balanced diet is OK.\n\n“Regular food that you find at the supermarket, or that you have in your house are enough.\n\n“Everything in moderation is fine — it’s about a balanced approached to eating.”\n\nDr Kyla Smith wants to educate parents, so they feel confident when feeding their children. Credit: Rae Fallon / Dr Kyla Smith\n\nIn fact, Smith says enjoying a meal out as a family, even at fast food restaurants like McDonald’s, can have benefits.\n\n“Food can teach us to share,” she said.\n\n“Eating together as a family is a social experience.\n\n“It can create good, positive memories.”\n\nAfter some parents reacted negatively to the post, Smith later updated it to explain that: “All foods have nutritional value”.\n\nSmith has been helping parents feed their children for 15 years.\n\nShe is also as a mum to two girls Elsie, 7, and Cleo, 4.\n\n“I know the struggle today’s parents have navigating limited time, information overwhelm, picky eaters and societal expectations,” Smith said.\n\nShe said fussy eating — refusing to eat vegetables, demanding the same meal or rejecting new foods outright — is very common.\n\n“Children go through phases,” she said.\n\n“Their appetite and preferences change frequently.”\n\nOne of the biggest myths is that children need to eat a full, balanced meal at every sitting.\n\n“What matters more is their overall intake over a week — not necessarily each individual day,” Smith said.\n\nAnother misconception is that kids should be pressured to finish their plates.\n\nBut forcing children to eat can have an adverse effect.\n\n“This can create negative associations with food and disrupt their natural hunger cues,” Smith said.\n\n“We can raise our children to respect their bodies and trust their hunger.\n\n“It’s not always easy in our diet-obsessed culture, but it is possible.”\n\nDr Kyla’s top tips for fussy eaters",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Australian model has a double mastectomy just before her 21st birthday: ‘It was pure shock’",
      "author": "Olivia Scott",
      "source": "7News",
      "url": "https://7news.com.au/lifestyle/australian-model-has-a-double-mastectomy-just-before-her-21st-birthday-it-was-pure-shock-c-15833708",
      "published": "2024-09-01T08:45:11+00:00",
      "content": "Most 21-year-olds are busy planning their birthday parties, studying or saving for a European summer holiday, not recovering from life-changing surgery.\n\nBut Australian model Lilly Chugg, now 22, from Newcastle, received the shock of her life almost two years ago when tests revealed she had the BRCA gene in her family, a discovery she made after her mother’s first cousin died from breast cancer.\n\nThe risks of developing breast and ovarian cancer are dramatically increased in those who inherit a harmful change in BRCA1 or BRCA2 genes.\n\nKnow the news with the 7NEWS app: Download today\n\nThe traumatic death of a close family member prompted Lilly’s mother Nicole to get a genetic test to see if she had the BRCA gene sequence, which she did, and Lilly shortly followed.\n\nWhen Lilly discovered she had also tested positive for the gene her initial reaction was “pure shock”.\n\n“My sister had also tested positive years earlier, so the fact my sister, mum and I all have this gene is very shocking. My heart sank finding out, I was very grateful I had my beautiful fiancé and parents in the room with me,” Lilly tells 7Life.\n\nLilly Chugg had a double mastectomy just before her 21st birthday. Credit: @lillychugg / Instagram/@lillychugg\n\nAfter discovering the shocking news Lilly had two options to consider: She could either undergo a double mastectomy and breast reconstruction or have yearly checkups.\n\n“For me it was a no-brainer to get a double mastectomy and reconstruction, as I didn’t want to have that fear of every year thinking what if this is the year I find out I have breast cancer,” Lilly said.\n\n“I was extremely anxious going into my surgery as there are plenty of things that could go wrong.”\n\nLilly described her recovery post-surgery as “fairly intense” particularly for the first three weeks.\n\n“After the fifth week I was able to get back into my daily routine, slowly but surely. You have drains for the first one to two weeks, which were very intense,” she said.\n\n“It was a huge mental challenge for me to have so much time off out of my routine as I’m such an active person, being bed bound was so draining mentally.”\n\nLily says the experience was a ‘huge mental’ challenge. Credit: @lillychugg / Instagram/@lillychugg\n\nLily says ultimately she is ‘proud and genuinely happy’ with her decision. Credit: @lillychugg / Instagram\n\nIt’s been 18 months since Lilly underwent the life-altering surgery and she can now say she feels “genuinely so happy and proud of her decision”.\n\n“I have no regrets at all, it’s such a relief knowing I have eliminated this risk,” she said.\n\nLilly still has to book in and see her surgeon annually just to make sure everything is as it should be.\n\nLily with her fiancé Ben. Credit: @lillychugg / Instagram/@lillychugg\n\nLilly’s stressed the importance of doing your family research so if someone in your close-knit circle has been affected by breast cancer you can get tested.\n\n“A lot of people don’t even realise you can get tested for it,” she said.\n\nFor those presented with the same dilemma as Lilly who are considering surgery as an option, she advises not to be discouraged by the fear of the unknown.\n\n“Remember that it’s your body and your decision,” she said.\n\nWhile Lilly was initially encouraged to wait until she was older she was hesitant.\n\n“I thought to myself why would I want to wait and what if I was the unlucky one to develop breast cancer and it would be too late? Always listen to your gut.”\n\nWith every purchase of the new ghd pink limited-edition collection, $20 is donated to the National Breast Cancer Foundation.\n\nThis year, Lilly has partnered with GHD to help spread awareness of the important topic of preventing breast cancer.",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Mum sparks family feud over her unique baby name choice",
      "author": "Olivia Scott",
      "source": "7News",
      "url": "https://7news.com.au/lifestyle/mum-sparks-family-feud-over-her-unique-baby-name-choice-c-15789353",
      "published": "2024-08-22T02:15:47+00:00",
      "content": "A new mum has sparked a family feud over her baby name choice.\n\nThe woman shared a post on Reddit describing the situation and asking for advice.\n\nThe mum said her husband had a “traditional family name” they loved and ever since they started dating and discussing their future, they agreed that their son would have that name.\n\nKnow the news with the 7NEWS app: Download today\n\nThe name in question is the traditional Irish moniker, ‘Oisín’.\n\n“My husband is Irish and not in the Boston, my great great, great grandfather came over in the 1800s kind of way. But in the born in Galway kind of way,” the woman said.\n\nMum sparks family feud over baby name: “Call him by his middle name or change the name.’ Credit: Getty Images/stock photo\n\nTensions arose after her brother and sister-in-law found out the name she had chosen and used it, even though she had already told them beforehand that she would be using it.\n\n“My brother and his wife have as much right to name their child whatever they want. I do not own the name. I have no right to dictate to my brother what he names his kid,” she explained.\n\n“However, neither my family nor my sister-in-law have any other connection to Ireland.”\n\nThe woman’s sister-in-law became pregnant about the same time she did and her son was born two months after theirs.\n\n“She got pregnant right around when I did, and her son was born two months before ours. They named him ‘Oisín Miguel’,” she said.\n\n“I didn’t get upset or anything,” she added.\n\n“But she has flipped out that two cousins will have the same name. She is nuts because our family is Hispanic, and half of our cousins are named ‘Carlos’ or ‘Camilla’.”\n\nThe woman’s sister-in-law is now “trying to insist that the couple call him by his middle name or change his name”.\n\n“I told her to p*** off,” said the woman.\n\n“My mum is staying neutral, but she was very surprised that my brother gave his son an Irish name which he knew I was planning on using. She expected him to name him for our late father.”\n\nThe woman finished her post by saying that her “husband’s family thinks the whole thing is hilarious, my family thinks my sister-in-law is a ‘weirdo,’ and she thinks I’m an a**hole for copying her”.\n\nThe woman’s post garnered more than 1000 comments and people were quick to side with the new mum.\n\n“Your husband’s family is right. So is your family. She doesn’t own the name,” said one.\n\n“Not the a**hole. You’re right, anyone can use a name,” added a second.\n\n“You’re not the a**hole, sounds like someone in the family likes to manufacture drama,” said a third.\n\n“Honestly, it sounds like your sister-in-law is overreacting. You had that name picked out long before she got pregnant, and it’s not like you’re trying to steal her son’s identity,” added another.",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "How to stop people from knowing you’ve stalked them on LinkedIn",
      "author": "Olivia Scott",
      "source": "7News",
      "url": "https://7news.com.au/lifestyle/how-to-stop-people-from-knowing-youve-stalked-them-on-linkedin-c-15788506",
      "published": "2024-08-22T02:02:49+00:00",
      "content": "If you say you don’t stalk people on LinkedIn, you either don’t use it or you’re telling white lies.\n\nWhether it be researching someone for an upcoming job interview, searching for potential employers or even checking out a date, we all do it.\n\nHowever, it can be pretty mortifying when they discover you’ve been lurking on their profile.\n\nKnow the news with the 7NEWS app: Download today\n\nBut a career expert called Amy, from the US, has shared in a now-viral video how to stop people knowing you’ve stalked them on LinkedIn.\n\nHow to stop people from knowing you’ve stalked them on LinkedIn. Credit: @hackyourhr / Instagram\n\nAmy explained that all you have to do is “go to your LinkedIn and then click settings and privacy under your profile”.\n\n“Then you click visibility and follow this with profile viewing options,” she said.\n\nAmy said that you don’t want “LinkedIn Pro”, you want to click on “private mode”.\n\nAnd then you can stalk people on LinkedIn without them knowing, it’s that easy.\n\nAmy leads HR at a global company and helps people get ahead in corporate jobs while also helping people to “understand the back end of the corporate world”.\n\nThe career expert frequently shares videos with HR advice and tips to her Instagram.\n\nAmy’s video garnered more than 26 million views and people in the comments section said.\n\n“Super helpful, love it,” said one.\n\n“Nice, I can get rid of my fake account now,” added a second.\n\n“Saving lives and careers,” joked a third.\n\n“Great tip, thank you,” added another.",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Kodi was on her lunch break when she found out she had cancer. She went back to work",
      "author": "Olivia Scott",
      "source": "7News",
      "url": "https://7news.com.au/lifestyle/kodi-was-on-her-lunch-break-when-she-found-out-she-had-cancer-she-went-back-to-work-c-15701598",
      "published": "2024-08-18T00:34:18+00:00",
      "content": "Brand specialist Kodi Brown, 27, from Brisbane, was living the dream in America, working at Disneyworld, when she noticed a change in her health.\n\nThen aged 21, Kodi confessed she didn’t have the “healthiest lifestyle” but never imagined she would be diagnosed with thyroid cancer at such a young age.\n\n“I was pretty much always exhausted but I put it down to the long hours and ignored it,” Kodi tells 7Life.\n\nKnow the news with the 7NEWS app: Download today\n\nIt wasn’t until the following year when Kodi — now a Daffodil ambassador for The Cancer Council — moved back to Australia that she decided to do something about how bad she was feeling.\n\n“My exhaustion didn’t get any better, I was always cold, my weight kept fluctuating, and I had a consistent sore throat as well as throat infections,” Kodi explains.\n\n“I felt what started out as a pea-sized lump in my throat keep growing over a seven-month period.”\n\nKodi Brown as shocked to be diagnosed with thyroid cancer in her early 20s. Credit: Kodi Brown\n\nBy the time the lump was the size of a golf ball, Kodi’s mum encouraged her to get it checked by a doctor.\n\n“My mum had had breast cancer, so I was always thorough with getting my breasts checked but I never considered my neck region,” Kodi says.\n\nShe went in for testing, including scans and blood tests, which came back inconclusive.\n\nDue to the size of the lump, the doctors then took a biopsy.\n\nThat’s when the diagnosis came back as cancerous.\n\nKodi had surgery to remove the lump in her throat. Credit: Kodi Brown\n\nKodi also underwent radioactive iodine treatment which is specifically for thyroid cancer. Credit: Kodi Brown\n\n“I was working at a warehouse in the morning and booked a doctor appointment for my lunch break to find out the results,” Kodi says.\n\n“I was then going to my internship in the afternoon.”\n\nKodi said her initial reaction to the diagnosis was shock.\n\n“I didn’t really react or cry, I just stared at the doctor and said, ‘OK thanks for sharing’,” she says.\n\nKodi then called her mother before heading straight to work at her afternoon internship.\n\n“I couldn’t quite process it in the moment, my mum was crying on the phone when I told her,” she says.\n\n“But then I had to drive to my internship and I started sobbing in my car. It was a very strange experience.”\n\nIn October, a month after her thyroid cancer diagnosis, Kodi had surgery to remove the lump in her throat.\n\n“My surgeon was my lifesaver,” she says.\n\n“We were hoping we could keep part of the thyroid so I wouldn’t be dependent on medication but it had spread so they had to remove my whole thyroid.”\n\nAfter recovering from the surgery, Kodi began radioactive iodine treatment — which is specifically for treating thyroid cancer — the following February.\n\nKodi is now a Daffodil ambassador for the Cancer Council. Credit: Kodi Brown\n\nKodi has now been in remission for five years but says ‘a cancer diagnosis is a life-long battle’. Credit: Kodi Brown\n\nThe treatment targets the throat region and involves a patient being alone in a hospital room for four days, “which is such an isolating experience,” Kodi says.\n\n“There are cameras in the room to monitor because they can’t come in,” she says.\n\n“For food drop offs, they knock at door and ensure you are standing in the corner. I had to wash my hair two times a day and dispose of everything I used.\n\n“Obviously there is physical trauma with cancer but with that also comes a lot of mental traumas, too. You are left with the mental scars even when you do hit remission.”\n\nWhile Kodi says she has “always been a very positive person and tried to continue to be” throughout her cancer journey, “it’s still a very dark, scary and lonely experience”.\n\n“I had the support of my family and my mum who had been through a similar experience but there were also beautiful organisations like Cancer Council,” she says.\n\n“When the darkness and the sadness consumed my life, I hit a point where I needed to talk to someone I didn’t know.”\n\nKodi is grateful for the support network of family and friends but says “it’s such a weird experience to share with people in your life”.\n\n“Being able to reach out to someone you don’t know is such a freeing experience,” she says.\n\n“When I first spoke to someone from Cancer Council, I felt as though I could let them know everything on my mind.\n\n“I would compare myself to other people experiencing cancer and live in fear that a reoccurrence is going to happen and would be afraid to make future plans.\n\n“The Cancer Council are there to guide you and make sure you are aware your feelings are valid.”\n\nKodi has now hit five years in remission but says “a cancer diagnosis is a life-long battle”.\n\n“I was in my final year of university when I was diagnosed but I was adamant I didn’t want to defer. However, I had to stop working and I was lucky enough to have my parents support me,” she says.\n\nKodi had to have speech therapy post-treatment. She also had problems moving her neck and a consistent cough.\n\n“A cancer diagnosis at times is sadly a game of luck, I was one of the lucky ones and I want to make sure that I am really experiencing life,” Kodi says.\n\nKodi became a Daffodil ambassado, saying: “Daffodil Day has always stood out to me. It brings hope and reminds you that there is brightness even in the darkest of times.”\n\nShe shared her story last year with her current workplace, Southern Cross Austereo, which is now a partner with Cancer Council.\n\nKodi’s advice for other people battling cancer is that while it is important to try to stay positive, “it’s also OK not to be OK”.\n\n“In those moments don’t be afraid to reach out,” she says.\n\n“There is always someone to guide you, you are not alone and try to see the good moments in the tough times and focus on small moments of joy.”\n\nDaffodil Day is August 24, 2024. You can find out more here.",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Movement the key to tackling kids mental health crisis in Australia",
      "author": "Digital Staff",
      "source": "7News",
      "url": "https://7news.com.au/news/movement-the-key-to-tackling-kids-mental-health-crisis-in-australia-c-19408881",
      "published": "2025-07-20T08:18:26+00:00",
      "content": "A major Australian study has found that regular movement, even unstructured play or casual activity, can significantly reduce symptoms of depression and anxiety in children and teenagers.\n\nResearchers at the University of South Australia reviewed 375 clinical trials involving more than 38,000 young people aged between five and 18.\n\nTheir findings show that physical activity has a powerful impact on mental health, and the benefits can appear within weeks.\n\nKnow the news with the 7NEWS app: Download today\n\n“We found that when children and teenagers moved more, through play, sport or exercise, it significantly reduced depression and anxiety,” said lead researcher Dr Ben Singh, a research fellow at UniSA.\n\nThe research comes amid growing concern about youth mental health, with one in four Australian children now experiencing symptoms of depression or anxiety, often from a young age.\n\nSingh said pressures from school, uncertainty about the future, and constant exposure to social media were major contributors.\n\nHe believes movement is a low-cost, accessible tool that can help families, schools and policymakers respond.\n\n“A lot of children either don’t receive treatment or don’t respond well to traditional methods like therapy or medication,” he said.\n\n“Movement gives us a practical alternative.”\n\nThe study found the greatest mental health improvements occurred in programs lasting fewer than 12 weeks, meaning children don’t need to wait months to see results.\n\nImportantly, the activity didn’t need to be intense or structured. Informal movement, such as walking, riding a bike or playing a game outside, delivered similar mental health benefits to team sports or exercise classes.\n\n“It doesn’t have to be elite sport,” Singh said.\n\n“A game of backyard cricket or a bike ride with friends is enough. What matters most is that kids are active.”\n\nBeyond physical benefits, movement was shown to boost confidence, improve energy levels and support social interaction, particularly when done with peers.\n\n“Children who move more tend to feel better, connect more and build confidence,” Singh said.\n\n“It’s something every parent and teacher can encourage.”\n\nThe research team is now calling on schools, communities and health professionals to treat physical movement as a key part of mental health care.\n\n“Movement should be part of the conversation when we talk about supporting young people,” Singh said.\n\n“It’s free, it’s effective and it could make a lasting difference.”",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Seven launches My Reno Rules with two lucky Aussies set to win the keys to multimillion-dollar homes",
      "author": "Caleb Taylor",
      "source": "7News",
      "url": "https://7news.com.au/sunrise/seven-launches-my-reno-rules-with-two-lucky-aussies-set-to-win-the-keys-to-multimillion-dollar-homes-c-19455279",
      "published": "2025-07-24T00:41:12+00:00",
      "content": "My Reno Rules is here!\n\nSeven will launch a new home renovation show fronted by Dr Chris Brown, with two multimillion-dollar homes up for grabs.\n\nFour hardworking teams of Aussie battlers will go head-to-head to breathe new life into two neighbouring rundown houses in a picturesque Melbourne suburb.\n\nKnow the news with the 7NEWS app: Download today\n\nThe twist is two lucky Aussies will receive a call to say they’ve won one of the spectacularly renovated multimillion-dollar homes.\n\nThe homes will be fully furnished, landscaped and feature state-of-the-art technology.\n\n“It may be the biggest giveaway ever on Australian TV,” Brown told Sunrise on Thursday.\n\n“If you’re not especially gifted on a circular saw or picking a colour palette, it’s quite appealing to know at the end of this series, live, you could win the homes you have just seen created during the show.\n\n“It is remarkable. It is an enormous, life-changing prize. These are two Australians who are going to get a brand-new designer home.”\n\nThe renovation teams will be vying for a cash prize.\n\nReality TV host Chris Brown speaking about new show My Reno Rules on Sunrise on Thursday. Credit: Seven\n\nOne of the Melbourne homes which will feature in the show. Credit: Seven\n\nAnother of the homes which will be renovated on the show. Credit: Seven\n\nRewards program LMCT+ founder Adrian Portelli donated the houses.\n\n“On previous reno shows, they might do auctions and, unfortunately, only 1 per cent of the viewing audience have the capacity to buy those homes,” Portelli said.\n\n“So, it’s an awesome feeling to be able to take the viewers on an emotional journey, watch the houses get renovated and transformed into a dream luxury home, then potentially win it.\n\n“It’s fantastic. It’s phenomenal.”\n\nPortelli said the renovations on the homes would have a wow factor.\n\nMy Reno Rules will hit TV screens next year. Credit: Seven\n\nSeven Group managing director of television Angus Ross said: “My Kitchen Rules is one of Australia’s most successful original formats and a powerhouse brand for Seven.\n\n“My Reno Rules takes all the heart and heat of MKR and applies it to renovation.\n\n“With showstopping house transformations, a life-changing cash prize for our winning team of renovators, and two multimillion-dollar dream homes up for grabs in an electrifying live grand final, we couldn’t be more excited for the premiere of My Reno Rules.\n\n“It’s going to be next level.”",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Up to $1.3 million: The top public school premium Australian homebuyers are paying",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/news/article/the-top-public-school-premium-australian-homebuyers-are-paying/2cxpvp819",
      "published": "2025-07-31T10:43:08.725658",
      "content": "Families are spending thousands — and in some cases, over a million dollars — to buy homes within the catchment zones of top-performing public high schools, according to new research.\n\n\n\n\n\nBut the analysis by property data firm Cotality also suggests that paying more upfront does not necessarily mean greater long-term price growth.\n\n\n\n\n\nThe report looked at house prices in nine popular school catchment zones across Sydney and Melbourne.\n\n\n\n\n\nIn seven of those zones, homes inside the catchment were more expensive than similar homes nearby but outside the boundary.\n\n\n\n\n\nHowever, six of those catchments recorded weaker capital growth over the past 15 years.\n\n\n\nEliza Owen, head of residential research at Cotality, said the results confirm what many buyers already suspect, that popular school zones often come with a hefty housing premium.\n\n\n\n\n\n\"These premiums may reflect the value placed on getting into top public schools, but it could also reflect an array of other factors like proximity to train stations, or the high incomes of those living inside the catchment area,\" she said.\n\n\n\nThe economics of catchment area homes\n\nHomes in the combined catchments of Killara High, Willoughby Girls and Lindfield Learning Village in Sydney's North Shore held a median value of nearly $1.3 million higher than homes nearby but outside the catchment.\n\n\n\n\n\nDespite this, houses in the catchment recorded lower long-term growth of 126 per cent over the past 15 years, compared to 150 per cent in neighbouring areas.\n\n\n\nIn Melbourne, the premium for homes in the catchments of Princes Hill and University High School reached $357,000.\n\n\n\n\n\nCapital growth was again weaker than that of the surrounding suburbs, with in-catchment homes growing by 82.6 per cent over 15 years, compared to 106 per cent in nearby areas.\n\n\n\n\n\nOwen said as affordability has worsened in many good school catchment areas, this may have contributed to a spill-over in demand outside of the zones, leading to lower total capital growth.\n\n\n\n\n\n\"In many cases, that means the premium has trended lower over time,\" she said.\n\n\n\nNot all school zone homes cost more\n\nThe report also found areas where homes inside a high-performing catchment were actually cheaper than those outside.\n\n\n\n\n\nHouses in Sydney's Cherrybrook Technology High School catchment were $155,000 lower than those outside the boundary in the same suburbs.\n\n\n\n\n\nIn Melbourne, houses in the Doncaster Secondary College catchment were $48,000 lower than those outside the zone.\n\n\n\n\n\n\"For many families, buying into a strong public school zone may still be a more affordable alternative to private education,\" a statement from Cotality said.\n\n\n\n\n\nAccording to Futurity Investment Group, the average cost of 13 years of private education in Australia was estimated at $349,000 in 2022, with significantly higher costs in Sydney and Melbourne.\n\n\n\n\n\n\"In six of the nine regions we analysed, the house price premium within public school zones was at least 100,000 dollars,\" Owen said.\n\n\n\n\n\n\"While that’s a significant upfront cost, it could end up saving families money when compared to paying for private schooling over many years.\"",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "The male breadwinner is gone. Why working from home is necessary for modern families",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/news/article/why-working-from-home-is-necessary-for-modern-families/wigcq21dp",
      "published": "2025-07-31T10:43:12.190458",
      "content": "Eb Yusuf had to return to work when her daughter was just eight months old — an experience she describes as traumatising.\n\n\n\n\n\n\"I was with my girl 24/7 up until that point and then I had to leave for eight, nine hours a day,\" the Sydney mother says.\n\n\n\n\n\n\"I'm still not over it.\"\n\n\n\n\n\nYusuf's employer at the time required her to return to the office full-time but she later found a part-time role that allowed her to work from home during the COVID-19 pandemic.\n\n\n\n\n\nThe 42-year-old is one of many Australian parents who say working from home and other flexible arrangements have become essential to the smooth functioning of their households and satisfaction with their family life.\n\n\n\nYusuf, who has since returned to full-time hours but continues to work from home three days a week, says she doesn't want to miss out on raising her child.\n\n\n\n\n\n\"I think in 2025 [work from home is] crucial,\" she says.\n\n\n\nI enjoy being able to be there for all those milestones [for my daughter], I don't want someone else to be having more time with my child than I am.\n\nYusuf's husband also works from home three days a week, and she says this helps them to pick up their daughter at a reasonable time from after-school care.\n\n\n\n\n\nOn days she works from home, she is also able to use some of her 30-40 minute commute time for exercise or other activities.\n\n\n\n\n\n\"[It gives me time to] do those things that make me a good mum, and a good employee, and a good wife, and happy within myself, so I think that's really important,\" she says.\n\n\n\nCost of living pressures force both parents to work\n\nDemographer Liz Allen, of the Australian National University, says workplaces have historically lagged in supporting parents in working effectively while maintaining their priorities as parents and their own personal well-being.\n\n\n\n\n\nBut working from home is enabling that and also breaks down barriers to gender equality in the workplace.\n\n\n\n\n\n\"It gives an expectation to workers that they have a right to work from home to make that work-life juggle [easier],\" Allen says.\n\n\n\n\n\nFor many women, staying home to look after their children is no longer an option.\n\n\n\nWe are no longer in a situation where we've got that male breadwinner — single income earner — in a family where a woman stays home and does everything by way of unpaid work.\n\n\"In order to pay for housing, we need dual-income earners,\" Allen says.\n\n\n\n\n\nAccording to the property listing company Domain, property prices have jumped by 777 per cent over the past three decades in some capital cities, such as Sydney, where the median price of a house is now $1.7 million — compared with a median of $192,819 in March 1993.\n\n\n\nHouse prices in Sydney increased by 777 per cent between 1993 and 2025, according to data from Domain. Source: SBS News But wage growth over a similar period has not kept pace, which has put extra strain on families. Wages in NSW grew by 131.1 per cent between September 1997 and March 2025.\n\n\n\nWages growth in Australia has failed to keep pace with the increased cost of housing. Source: SBS News\n\nWomen are more likely to work now\n\nSocial researcher Mark McCrindle points out that women in their early 30s — an age when many would be having children — are now twice as likely to be working compared to their own mothers at the same age.\n\n\n\n\n\nHe explains: \"77 per cent of women in their early 30s are in the labour force — it was less than a third a generation ago.\"\n\n\n\nEmployment for women aged in their 30s once dropped sharply but now it barely dips. Source: SBS News Based on the Australian Bureau of Statistics' Time Use Survey, conducted between November 2020 and July 2021, McCrindle notes that a third of Australians also report feeling rushed or pressed for time often or always.\n\n\n\n\n\nAround 38 per cent of women reported this, and 32 per cent of men.\n\n\n\n\n\nWomen aged 35 to 44 years were the group most likely to report feeling rushed for time (55 per cent).\n\n\n\nREAD MORE Cheryll tried to get pregnant for years. One thing sealed her decision to stop\n\nMcCrindle says working from home is seen as a way of reducing that stress or time pressure, as workplaces are traditionally located in CBDs well away from where people live, and where schools, childcare, shopping and other family and social connections are located.\n\n\n\n\n\nThe rising cost of housing has pushed people even further away from workplaces.\n\n\n\n\n\n\"The only way to really make all of that work is to have less time conducting that commute, and that's where I think work from home achieves that,\" McCrindle says.\n\n\n\nWork from home has become a lifeline for parents\n\nYusuf, whose daughter is now seven years old, has been promoted to the senior leadership team at her work, and says her experiences motivated her to support flexibility for employees returning from maternity leave, so they can return to work in a way that makes them comfortable.\n\n\n\n\n\n\"[There's] no clock watching, so you're not making sure people arrive at a certain time or leave at a certain time,\" she says.\n\n\n\nI've heard of businesses saying you need to prove that you've got child care — somebody in the house helping you with the child — in order to be paid for this day of work.\n\n\"We don't do anything like that because we just know that our people will make it work.,\" Yusuf says.\n\n\n\n\n\nShe hopes flexible work arrangements will ultimately enable women to take on leadership roles while still allowing them to be the parents they aspire to be.\n\n\n\n\n\n\"I know a lot of women in senior roles who have the house husband or the au pair, but I don't want to miss out on that time with my child,\" she says.\n\n\n\nEb Yusuf is ambitious about her career but doesn't want to miss out on spending time with her daughter. Source: Supplied Yusuf's heard messages directed towards women that if they want to be a boss or CEO, they need to be in the office.\n\n\n\n\n\nBut she points out she has a vested interest in the business performing well.\n\n\n\n\n\n\"I've worked in this business for nearly five years. They know that I want to do a good job and I'll get it done,\" she says.\n\n\n\n\n\n\"Whether it's [because I'm clocking on] outside of work hours or whether I just do it quicker ... because I'm a mum and I need to be efficient with my time.\"\n\n\n\n'I just love my life so much more'\n\nKerrie Cullimore, 41, has 12-year-old twins and says she left her previous job because the demands of full-time work and commuting for almost three hours a day were unsustainable with young children.\n\n\n\n\n\nCullimore says it felt like work took up a huge part of her life.\n\n\n\n\n\n\"I was gone from the house for like 13 hours a day or something ridiculous. [I was home at] 7 o'clock at night,\" she says.\n\n\n\nI remember standing in the bus line looking around at everyone [one] night ... thinking ... 'I don't want to do this for the rest of my life. This is horrible'.\n\nCullimore, who found a part-time role closer to home in the finance department of a media company, says being allowed to work remotely meant her family could make a life-changing move from Sydney to Port Stephens.\n\n\n\n\n\n\"I can take my dog for a walk in the morning, the kids get on the bus [just outside my house], I'm here in the afternoon when the kids get home [and] I can make dinner,\" she says.\n\n\n\n\n\n\"I can jump on and off online depending on my work schedule, and I just love my life so much more.\"\n\n\n\n\n\nThe arrangement is also beneficial for her employers as she logs in every day, even though she has a part-time role.\n\n\n\n\n\n\"If I had to go into the office, I would definitely go in for the three days only,\" she says.\n\n\n\nKerrie Cullimore loves her life after working from home enabled her family to move to Port Stephens. Source: Supplied Cullimore also appreciates that her workplace allows staff members who work from the office to leave around 2.30pm to pick up their children from school.\n\n\n\n\n\n\"Nobody cares ... they go home and finish the rest of their work at home,\" she says.\n\n\n\n\n\n\"It's just so lovely to work for a company that is really accommodating to parents, and understands that parents can be more part of their children's life.\"\n\n\n\nPush to get workers back in the office\n\nWhile working from home is valued by employees, some employers have pushed to get staff back in the office.\n\n\n\n\n\nDuring this year's federal election campaign, former Opposition leader Peter Dutton proposed forcing Canberra public servants back into the office , something that Redbridge Group director Simon Welsh says started to shift attitudes against Dutton.\n\n\n\n\n\nWelsh says the research agency, which conducts focus group polling, observed how voters began to view Dutton as a risk to their finances because working from home was valued for helping them save money on things like public transport, food and childcare.\n\n\n\n\n\n\"When you've got people that are in survival mode and they see [work from home] as a solution to it — and a solution that is fair — [it's] pretty hard to come out and argue against that,\" he says.\n\n\n\nRedbridge's research found working from home also made mothers feel better about themselves and relieved some of the stress of parenting.\n\n\n\n\n\n\"[Mothers] don't feel like they're neglecting their kids ... they can be there to pick the kids up from school rather than having the kids go to an after-school program,\" he says.\n\n\n\n\n\n\"That matters to fathers as well, but it's particularly acute for women.\"\n\n\n\n\n\nDutton is not the only leader trying to roll back work-from-home arrangements.\n\n\n\nLISTEN TO New research shows just how much money people working from home save SBS News 03:56 English\n\nA survey of 500 employers conducted in November by recruitment agency Robert Half found 39 per cent wanted workers in the office five days a week in 2025, up from 36 per cent in 2024.\n\n\n\n\n\nOverall, the number of mandated in-office workdays was expected to rise from an average of 3.43 days a week in 2024 to 3.64 days a week in 2025.\n\n\n\n\n\nAmong employers planning to mandate in-office days this year, around 40 per cent believed this would help improve productivity.\n\n\n\nThe benefits of working from home\n\nThe Albanese government has identified productivity as a key economic focus of its second term, following data from the Australian Bureau of Statistics that shows the productivity growth rate has slowed to its lowest level in at least 20 years.\n\n\n\n\n\nBut a report from the Productivity Commission released in September 2021 recommended that governments not stand in the way of working from home.\n\n\n\n\n\nProductivity Commission chair Michael Brennan says: \"On balance, working from home can unlock significant gains in terms of flexibility and time for employees, and could even increase the nation's productivity.\"\n\n\n\n\n\n\"Risks can be managed but we should keep an eye on them and be ready to intervene if necessary.\"\n\n\n\nBrennan says the COVID-19 pandemic had greatly accelerated the take-up of technology that assisted work-from-home opportunities.\n\n\n\n\n\n\"In less than two years, we have gone from less than 8 per cent of Australians working from home to 40 per cent,\" he says.\n\n\n\n\n\n\"While this percentage may not always remain so high, it is inevitable that more Australians will work from home.\"\n\n\n\nWork from home is unlikely to disappear\n\nMcCrindle believes a hybrid model, where at least some work is done at home, is \"baked in\" and not just because it benefits families.\n\n\n\n\n\nWorking from home gives people more time for hobbies, social engagements, volunteering, and even a side hustle or entrepreneurial activity. It enables older workers to help out with grandkids and those who are neurodivergent to participate in the workplace more fully.\n\n\n\n\n\nIt may also help parents who don't want to put their children in childcare to manage care with help from grandparents or extended family while continuing to work. Mothers may also be able to breastfeed for a longer period.\n\n\n\n\n\n\"The bigger picture has to be beyond purely GDP [gross domestic product] measures to the other social measures of wellbeing, social fabric, engaged family, and investment in the next generation,\" McCrindle says.\n\n\n\n\n\n\"Any flexible practices that can help accommodate that, I think, is an investment in the future.\"",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "In a burgeoning $82 million Aussie industry, some are being left behind",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/news/small-business-secrets/article/bush-food-industry-worth-millions-but-indigenous-australians-missing-out/e3qk22sf3",
      "published": "2025-07-31T10:43:15.898941",
      "content": "Food has always been a language for Brisbane-based chef Chris Jordan — a way to connect, share and tell stories beyond the plate.\n\n\n\n\n\nAfter spending two decades in commercial kitchens across Australia and the United Kingdom, it wasn't until he began working with native Australian ingredients that he truly found his calling.\n\n\n\n\n\nDiscovering the richness of native foods — from earthy wattle seed to zesty lemon myrtle and nutrient-packed Kakadu plums — helped the 35-year-old Koori chef define his purpose.\n\n\n\n\n\nNow, Jordan is sharing that passion with young Indigenous apprentices. As they gather around a small outdoor grill, he stands over smoking sea mullet, the rich scent rising from gidgee charcoal.\n\n\n\n\n\n\"Make sure the grill is super-hot so the fish doesn't stick,\" he said.\n\n\n\nA legacy of native flavours\n\nWatching Jordan cook is a flavour-packed journey of discovery for these emerging Indigenous chefs, including 26-year-old Terelle Cobbo.\n\n\n\n\n\nAs sea mullet sizzles, Jordan serves up more than just techniques — he's firing up their curiosity and seasoning each moment with cultural knowledge.\n\n\n\n\n\n\"This is one way to connect with my culture and I really enjoy it,\" Cobbo said.\n\n\n\n\n\nGiving the next generation a real taste of connection with the country, Jordan said one the reasons he focuses on native ingredients is sustainability.\n\n\n\n\n\n\"Bush foods are drought resistant, well adapted to this country, and really, really good for you — nutritionally potent,\" he said.\n\n\n\n\n\n\"Using native ingredients can also help to combat climate change.\"\n\n\n\nKoori chef Chris Jordan teaches young trainees how to prepare traditional native foods using bush ingredients. Source: SBS / Jesmine Cheong Sharing Jordan's perspective, Dr Francis Wyld, who teaches Aboriginal studies at the University of South Australia, said bush foods offer many environmental advantages.\n\n\n\n\n\nThey are also rich in nutrients and have the ability to thrive in a range of Australian climates, she said.\n\n\n\n\n\n\"They require less water or pesticides, because they are well adapted to the Australian environment,\" she said.\n\n\n\n\n\n\"These foods have sustained Aboriginal people for 60,000 years and many are full of things like vitamin C.\"\n\n\n\n\n\nThe University of Sydney estimated Australia's bush food industry was worth $81.5 million in the 2019-2020 financial year, and is growing steadily.\n\n\n\n\n\nYet Jordan said only a few Indigenous growers benefit from the booming sector and a growing demand for native ingredients.\n\n\n\n\n\n\"Less than 3 per cent of Australia's bush food industry is Aboriginal and Torres Strait Islander owned, and I think that really needs to shift,\" he said.\n\n\n\n\n\n\"We need to make sure that the money goes back to the community. It is one reason we collaborate with a lot of different restaurants and cafes.\"\n\n\n\n\n\nJordan buys bush food and ingredients from local growers, with the help of Food Connect Shed in Brisbane.\n\n\n\nFood Connect Shed CEO Robert Pekin said his long-term objective is to bring First Nations food into the mainstream Australian diet. Source: SBS / Jesmine Cheong The hub's CEO, Robert Pekin, said the shed is owned by approximately 540 people and most are local residents.\n\n\n\n\n\n\"One of our big long-term objectives is to get First Nations food into our diets in a mainstream way,\" he said.\n\n\n\n\n\n\"Native grains and native foods are really beneficial for the country.\"\n\n\n\n\n\nIt's a view shared by Aunty Dale Chapman, an award-winning chef who first mentored Jordan in cooking with native ingredients after he returned from London in 2017.\n\n\n\n\n\n\"I am extremely proud of where Chris has started, and his journey is still happening, and it'll go on for a long, long time,\" she said.\n\n\n\n\n\nJordan learned more by visiting country with his great-uncle and elders, and has also studied Indigenous philosophy at the University of South Australia.\n\n\n\n\n\nHowever, he said finding a mentor in Chapman changed his life and gave him a purpose.\n\n\n\n\n\n\"I vividly remember really, really low points in my life where I was asking for guidance and I was asking for someone to help me and give me a reason to live,\" he said.\n\n\n\n\n\n\"And the biggest reason for me getting sober was meeting Aunty Dale. She has been in the bush food industry for 35 years and is an amazing chef, an amazing educator and someone who is passing the torch with her education.\"\n\n\n\nAunty Dale Chapman is an award-winning chef based in Queensland's Sunshine Coast. Source: SBS / Sandra Fulloon Chapman, who was born at Dirranbandi in south-west Queensland on Yuwaalaraay and Kooma tribal lands, celebrates native foods in her cooking.\n\n\n\n\n\nShe said Jordan has elevated the use of native ingredients, and his dedication to sharing his knowledge with young people is vital to preserving the Indigenous food legacy.\n\n\n\nMentoring through food\n\nJordan now mentors young chefs as he teaches in schools across Queensland and also supports Indigenous youth at risk of contact with the justice system.\n\n\n\n\n\n\"A huge percentage of our First Nations youth are incarcerated. So, it is really important to build a connection to culture and also create pathways to employment,\" he said.\n\n\n\n\n\nData from the Australian Institute of Health and Welfare (AIHW) found First Nations youth are 27 times as likely to be in juvenile detention compared to non-Indigenous children.\n\n\n\n\n\nThe AIHW said the vast over-representation of Indigenous youth in the justice system reflects a history of trauma and cultural dispossession.\n\n\n\n\n\nWhile Jordan is proud to mentor young people through bush foods, accepting and celebrating his own identity has been a far more complex journey.\n\n\n\n\n\nGrowing up in northern NSW, he learned little about his Aboriginal heritage or his connection to Kamilaroi Country.\n\n\n\n\n\n\"When my grandmother was growing up, she was told, 'If anyone asks, say that you're Italian'. So, there was a lot of shame in the family,\" he said.\n\n\n\n\n\n\"It is amazing in my lifetime I have seen that shift, and now my extended family are so proud of who they are.\"\n\n\n\nChris Jordan (left) as a young man with his mum and sister near Denman, NSW. Source: Supplied / Chris Jordan Jordan named his catering business in memory of his father Joseph, a refugee from former Yugoslavia who died when he was a baby.\n\n\n\n\n\n\"I don't have any memories of him at all,\" he said. \"So, it is one reason I named my [catering] business Three Little Birds.\n\n\n\n\n\n\"It was his favourite song by Bob Marley, so I guess it's a message of positivity in our family.\"\n\n\n\nChris Jordan's father, Joseph, arrived in Australia in 1950. Source: Supplied / Chris Jordan\n\nA 'powerful' journey of rediscovery and connection\n\nJordan said learning to cook with native foods has helped him find a deeper meaning in his life and identity.\n\n\n\n\n\n\"I left home at a young age and went down a path where I ended up having to get sober and really clean my life up,\" he said.\n\n\n\n\n\n\"And learning about native ingredients and becoming proud of who I am was really, really powerful.\"\n\n\n\n\n\nChapman said by shining a light for other young Indigenous chefs, Jordan is passing on knowledge from one generation to the next.\n\n\n\n\n\n\"We want to give that information, because that is ultimately what our ancestors have done for thousands of years,\" she said.\n\n\n\n\n\n\"Understanding where the plant, the fruit, the herb, the spice actually comes from is really, really important.\n\n\n\n\n\n\"And let's face it, it is our birthright and we should know how to use, how to sustain, how to thrive using First Nations foods.\"\n\n\n\nDylan Kerslake works as an apprentice chef in Brisbane. Source: SBS / Jesmine Cheong Wiradjuri man Dylan Kerslake is one of Jordan's mentees and works as an apprentice at a high-end Brisbane restaurant\n\n\n\n\n\n\"Chris encouraged me to become a chef and helped me to get my first job,\" he said.\n\n\n\n\n\n\"I started by helping him out in the kitchen, and I really enjoyed it, and from there I kept on cooking.\"\n\n\n\n\n\nBut for Jordan, it's about more than employment — it's about sharing the wealth of Indigenous wisdom through the craft of cooking and helping young people build a future through food.\n\n\n\n\n\n\"I didn't connect to culture until later in life.\n\n\n\n\n\n\"So, passing on knowledge about bush food and sharing my experience and how it saved my life, I think it's a really strong message.\"\n\n\n\n\n\nNAIDOC Week is celebrated from 6-13 July. This year's theme is: 'The Next Generation: Strength, Vision & Legacy.'",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "The future of hospitality in Australia, according to Peter Gilmore",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/food/article/chef-peter-gilmore/b3erxr7ko",
      "published": "2025-07-31T10:43:19.899267",
      "content": "Stream free On Demand A Girl's Guide to Hunting, Fishing and Wild Cooking series • cooking PG series • cooking PG\n\n\n\n\n\nFine dining runs through the veins of Peter Gilmore, executive chef of two of Australia’s most awarded restaurants, Quay Restaurant and Bennelong . So it comes as no surprise that he thinks fine dining is alive and well, and not a dying art in Australia what with rising costs of living and the hospitality industry skewing ever more heavily towards a more casual approach.\n\n\n\n\n\n“There are times where, economically, there are not as many fine dining restaurants around,” Gilmore tells SBS. “Right now [may be one of those times] as the cost of living is really high for everyone. But I do think there is a place for fine dining in our culture.\n\n\n\n\n\n“I guarantee you that every five years or so, journalists say ‘fine dining is dead or dying’. But it hasn’t died yet.”\n\n\n\nPeter Gilmore, executive chef at Bennelong (pictured) located inside Sydney's iconic Opera House. Credit: Nikki To The high-end dishes offered at Gilmore’s restaurants, from his famous ‘snow egg’ to yabby tails and buckwheat pikelets, have been the lifeblood for this Sydney born and bred chef. Yet, at the heart of all the intricate creations lies a very simple concept – that of putting excellent produce first.\n\n\n\n\n\nIt is this fascination for produce and farming that has led him to swap city life for a humble rural destination south of Hobart in Tasmania once every six weeks or so. It’s here that he spends his time growing fresh produce that he either eats himself or distributes to his restaurants.\n\n\n\n\n\nHe is not the only chef to make the tree-change to Tasmania. His former protege Analiese Gregory who once worked at Quay also has a farm in southern Hobart, and the two – who have remained friends – exchange stories and notes on pushing their sustainable food game forward in Season 2 of Gregory's show, A Girl's Guide to Hunting, Cooking and Wild Fishing.\n\n\n\nPeter Gilmore and Analiese Gregory are former coworkers, friends and now, neighbours in Tasmania. Matthew Evans, who is a fully fledged farmer in Tasmania now, is another example of a high-end chef being attracted to Tasmania, as is Rodney Dunn, co-founder and executive chef at The Agrarian Kitchen.\n\n\n\nTasmania's culinary appeal\n\nSurrounded by the beauty of Tasmanian nature, Gilmore gets his hands dirty in the garden, eats food fresh from the land and sea, and strengthens his attachment to quality produce.\n\n\n\n\n\n“On my farm, I'll grow different varietals of things like ancient Japanese white turnips that have a unique flavour and colour,” he says. “They might have beautiful leaves that you can sauté as well.”\n\n\n\n\n\n“In a few years’ time, I wouldn't mind moving to Tasmania permanently. I just love the fact there are four distinct seasons there. It’s great for growing beautiful produce – and that’s important to me.”\n\n\n\nGilmore explains the Tasmanian attraction for chefs with one word, which interestingly, connects right back to his fine dining food philosophy – produce.\n\n\n\n\n\n“There are so many small producers and farmers in Tasmania that are growing produce for three-to-four restaurants. They might be breeding heritage pigs or have incredible vegetables in their garden. Access to produce and personalised relationships with small-scale farmers is what I believe makes Tasmania quite special.”\n\n\n\n\n\nRelationships, like those that Gilmore has with small-scale farmers in Tasmania, also help to develop Australia’s food scene. “Fine dining chefs support producers to grow unusual items that aren't found in the supermarket, like an heirloom carrot variety that’s 300-years-old and has an amazing flavour. Because I'm willing to pay a little bit more for it, that makes it viable for that small farmer to grow it.\n\n\n\nPeter Gilmore in Tasmania: \"I just love the fact there are four distinct seasons there. It’s great for growing beautiful produce – and that’s important to me.” \"Fine dining restaurants also work with ingredients that are a little bit left of centre, are more expensive or require a lot of time. I do a little sea cucumber crackling that tops a rice dish. That sea cucumber crackling actually takes five days to prepare.”\n\n\n\n\n\nCreativity is key to all quality dining experiences. If restaurants just did the same food all the time, he says, “life would be a lot more boring. We need a few leading lights in the industry to experiment with food, push the genre forward and create new ideas and new dishes”.\n\n\n\nThe purpose of fine dining: innovation\n\nOne such new idea is Analiese Gregory's new 10-seater farm-to-table eatery, which debuts in the final episode of Season 2 of her show .\n\n\n\n\n\nGilmore says her eatery is an innovative fine dining model. “Fine dining has got a couple of different directions it can go in. One of them is a smaller restaurant that focuses on locally sourced ingredients. The service side of Analiese’s eatery will be more relaxed but the food itself will showcase her [fine dining] expertise and the beauty of the area. If you get a booking, you’ll be in for a very special experience.”\n\n\n\n\n\nGilmore emphasises the role of the word ‘special’ in high-end dining. He says all fine dining meals should have a ‘special’ quality, no matter if they are served from a small home-based eatery in Tassie or at a three-hatted restaurant in Sydney.\n\n\n\n“Fine dining might not be something you do every day of the week, but having a beautiful meal at nice restaurant can make people feel quite special.”\n\n\n\n\n\nEssentially, it’s the diners, innovative food experiences and quality produce from farmers across Australia that will keep fine dining alive for a long time to come. “An older person might go to a fine dining restaurant to celebrate their birthday and say ‘that was the best meal of my life’ after the main course. Or a couple might get engaged at your restaurant and return to celebrate their anniversary.",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Work out turmeric’s hidden magic with this simple Kashmiri chana dhal",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/food/article/work-out-turmerics-hidden-magic-with-this-simple-kashmiri-chana-dhal/cdayiu04l",
      "published": "2025-07-31T10:43:20.083553",
      "content": "Long before turmeric was a trend, it was an integral part of Indian cooking. This is a spice of subtle impact – its role is to stay in the background and create depth on the palate. Turmeric pushes what is sweet and earthy and acidic in the pan to the surface, helping its fellow aromatics to shine.\n\n\n\n\n\nTo wit: dhal. No other dish shows the hidden work of turmeric like this Indian kitchen staple.\n\n\n\n\n\nSoak some medium to firm lentils in cold water for a few hours or overnight. Gram and chana dhal are my favourites – their textural qualities mean the individual lentil holds its shape slightly once cooked, without requiring the longer cooking time of yellow split peas. For dhal, I always steer clear of moong and red lentils (because they're softer in nature, they tend to produce a gluggier end product). Toor is a good intermediary between a soft and a hard lentil, if I’m short on soaking time.\n\n\n\n\n\nMy soaked lentils are drained and thrown into my pressure cooker (can’t live without it) and then covered with fresh cold water. The amount of water depends on the type of lentil and length of soaking time, but a good rule of thumb is that the water should cover the lentils without drowning them – maybe a centimetre or so above the surface of the lentils.\n\n\n\nThis is turmeric’s strength – to bolster its sibling spices with a bitterness that lifts, but never overpowers.\n\nNow comes the magic.\n\n\n\n\n\nInto the pressure cooker, I’ll toss one heaped teaspoon of soft Himalayan pink salt for around 1.5 cups of lentils. With a harder white salt, I’d use a little less – white salt carves a much deeper groove on the tongue. The salt will lift and drive the lentils out of inertia and into a more active playground of flavour.\n\n\n\n\n\nNext up is a half knuckle of jaggery or gur . An unrefined cane sugar, jaggery has buttery caramel and fudge tones; it is a sugar with depth, texture and a wonderful round flavour, void of one-dimensional sweet spikes.\n\n\n\n\n\nTurmeric brings the dimension. Not too much. A shy half-teaspoon. The bitterness should be behind the curtain. This is turmeric’s strength – to bolster its sibling spices with a bitterness that lifts, but never overpowers.\n\n\n\n\n\nMORE FROM SARINA Turmeric sausage rolls\n\nOur palate constructs taste by recognising contrast. Flavour is friction. As a soft bitter, turmeric plays up the sweetness and the salt, giving those lentils a strong frame to wrap around.\n\n\n\n\n\nPressure-cook or slow-cook the spiced lentils to softness.\n\n\n\n\n\nOn their own, the salt and the jaggery would be enough to make a tasty base for dhal. Simplicity itself. But really, the dish deserves a little more. Cumin seed, Kashmiri red chilli, fresh ginger and ground ginger heated in a pan with ghee as the chownk that builds upon turmeric’s foundation. Stir through the cooked dhal and finish with a half teaspoon of garam masala.\n\n\n\n\n\nDhal shows that turmeric’s role is to be the structure, not the star. It’s the quiet bitter. The secret strength in all of my Kashmiri pans.\n\n\n\n\n\n——————\n\n\n\nKashmiri chana dhal\n\nServes 4 | Prep 25 minutes | Cooking 25 minutes\n\n\n\n\n\nIngredients\n\n\n\n\n\n2 cups chana dhal, soaked overnight\n\n½ tsp ground turmeric\n\n1 knuckle of jaggery\n\n2 tsp salt (heaped)\n\n1½ tbsp ghee\n\n½ knuckle fresh ginger\n\n¾ tsp dried Kashmiri red chilli\n\n⅓ tsp ground ginger\n\n2 tsp cumin seeds (heaped)\n\n½ tsp garam masala\n\n\n\n\n\nInstructions\n\n\n\nPut drained chana dhal in a pressure cooker with the turmeric, jaggery and salt. Pressure cook for around 7 minutes. Once cooked, in a separate pan, add the ghee and the rest of the fresh and dried spices, except the garam masala. Warm through until fragrant. Add hot to the dhal. Stir through. Finish with the garam masala. Stir through. Serve hot.\n\n\n\n\n\nFind Sarina at her website and on Instagram .\n\n\n\n\n\nCook's Notes",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Embrace the joy of melting moments with these tips and recipes",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/food/article/melting-moments-tips-and-recipes/61zykv4ku",
      "published": "2025-07-31T10:43:20.235904",
      "content": "A melting moment – a really GOOD melting moment – is a joy. Tender, buttery and usually sandwiched with a rich buttercream, they are a favourite in cafes and home kitchens alike.\n\n\n\n\n\nAnd they are a favourite of keen home baker and cookbook author Tilly Pamment , too.\n\n\n\n\n\n“I have loved melting moments for as long as I can remember,” Pamment tells SBS. “They were always the biscuits I chose at cafes and bakeries as a child and still do, if I'm honest! I love the buttery, melt in your mouth texture of the biscuit – good ones always crumble all over your lap – and the creamy buttercream filling (passionfruit if at all possible!).”\n\n\n\n\n\nIf you’ve ever wondered how to make melting moments, here are some tips and recipes to answer all your questions.\n\n\n\nMelting moment, yo-yo or custard kiss?\n\nBut first, let's address what exactly is a melting moment. You may have seen very similar biscuits under all of these names and wondered what the difference is. What they all have in common is a dough made with butter, icing sugar (most commonly, though you’ll find some recipes that use caster sugar) and plain flour, plus either custard powder or cornflour.\n\n\n\nMelting moments from CWA Victoria. Credit: Murdoch Books / Cath Muscat\n\n\n\nIn the past, it was often said that melting moment recipes used cornflour in the biscuit dough (such as this classic CWA Victoria recipe ), while yo-yos (sometimes called custard kisses) used custard powder.\n\n\n\n\n\nHowever, there seems to be a lot more cross-over with naming these days, and indeed the passionfruit and citrus melting moments recipe that Pamment has included in her new book, Handfuls of Sunshine , is made with custard powder. We asked her whether she thinks of melting moments and yo-yos as different biscuits.\n\n\n\n\n\n“I wondered about this when naming them in my book. But for me (and maybe this is a regional or generation thing) this type of biscuit was always known as a melting moment in both the cafes and recipes I cooked from as a child,\" she says.\n\n\n\n\n\n\"I personally love the addition of custard powder in these biscuits, not only for the sunny-yellow colour it adds, but also for the vanilla-custard flavour it imparts. I think essentially they are the same type of biscuit – but people come to know and love them as either melting moments or yoyos.”\n\n\n\nPassionfruit and citrus melting moments. Credit: Tilly Pamment / Murdoch Books The most common shape is a simple round biscuit, with parallel indents made with a fork before baking. But you may occasionally see a star-shaped biscuit too, created by using a piping bag fitted with a fluted nozzle to shape the dough.\n\n\n\nWhat makes a great melting moment recipe?\n\nNo matter what you call them, the tender texture is what makes these buttery biscuits so good (well, that and plenty of filling!). The use of cornflour or custard powder is a key part of that, as they create a tender, crumbly biscuit texture, as Alice Zaslavsky notes in her recipe for Lady Marmalade melting moments , which uses custard powder: “I’ve adopted the custard powder of the classically Aussie yo-yo biscuit, because I like the colour and flavour it provides,” she says).\n\n\n\nMarmalade melting moments. Credit: Murdoch Books / Ben Dearnley For Pamment, the secret is good ingredients: “For me, it's about using quality ingredients – real butter, not margarine in both the biscuit and the filling, as well as good-quality vanilla bean paste or extract. And real fruit or fruit juice to flavour the buttercream filling.”\n\n\n\n\n\nTwo more tips for success: have the butter at room temperature before you start making the dough so it creams evenly, and cool the biscuits completely before sandwiching them with filling.\n\n\n\nClassic or new flavours?\n\nThe classic melting moment is a plain, buttery biscuit with a lemon or passionfruit filling, usually a buttercream (such as these gluten-free melting moments with passionfruit icing ), or sometimes a simple butter icing.\n\n\n\nGluten-free melting moments Credit: Harper Collins But there are endless variations too. Add flavours to the biscuit dough, such as citrus zest. Change up the buttercream flavours – find inspiration from this buttercream recipe that includes chocolate, margarita, peanut butter, Bailey’s Irish Cream and mint chocolate variations, among others. You can also wwap the buttercream for cashew cream filling as this recipe shows.\n\n\n\n\n\nOr, try a chocolate melting moments version with Trish Mackenzie’s recipe , which she shares in Everyday Gourmet . She adds cocoa to the dough and to the filling to make for a chocolate-y treat.\n\n\n\nChocolate melting moment biscuits. Credit: Everyday Gourmet with Justine Schofield And the flavours keep evolving – we’ve even spotted matcha melting moments and fairy bread melting moments . Iff you can get your hands on a copy of the out-of-print Lady Campbell Cookbook from the Queensland CWA, there are even Hawaiian moments made with coconut and pineapple.\n\n\n\nHow long will melting moments keep?\n\nThe filled biscuits will keep for four days or so in an airtight container at room temperature (if the weather is hot, you may want to store them in the fridge). That makes them a great idea for a gift.\n\n\n\n\n\nAnd can you freeze melting moments? “Personally I have never given this a go – as a batch of melting moments never seems to last long enough in our house! But I am reliably informed that this works a treat,” Pamment says.\n\n\n\n\n\nFor best results, we suggest freezing in single layers in an airtight container for up to two months and letting them thaw fully at room temperature before serving. You could also freeze the unbaked dough .",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "How specialty grocery stores have come to be cultural capsules for migrants in Australia",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/food/article/specialty-grocery-stores/93i2g6614",
      "published": "2025-07-31T10:43:20.530089",
      "content": "When I first moved to Sydney from India almost a decade ago, I remember being in awe when I walked into one of the shiny, bright supermarkets – rainbow-coloured vegetables, clear punnets of berries, chicken drumsticks in neat packages, instant foods and treats in colourful packaging . Everything was so clean, not like the markets of my childhood where vegetables often came home with soil still clinging to the roots .\n\n\n\n\n\nThe joy lasted for a few weeks until I started craving the comfort of flavours from home.\n\n\n\n\n\nI went back to the same supermarket chains which seemed to have every ingredient you could think of – except they didn't. So I did what every immigrant student does and looked up the closest Indian grocery store to me.\n\n\n\n\n\nInstantly, I felt transplanted into a pocket of India . There were ceiling-high metal racks stacked with jars of pickles, ghee and groundnut oil, varieties of rice and wholemeal flour in sacks as big as my torso, fresh green chillies and raw mangoes, and large trays of Indian sweets at the front.\n\n\n\n\n\nThe scent of sugar syrup and rosewater mingled with the slight dustiness of anything that sits in a shipping container for weeks, yet there’s a strange familiarity to it. Old Bollywood music played in the background, familiar packaging surrounded me, and I could hear other customers speaking in Hindi to the shopkeeper – it was in this little corner shop that I found a piece of home.\n\n\n\nSpecialty grocery stores stock products you can't easily find elsewhere. For immigrants from all around the world, this is a familiar feeling.\n\n\n\n\n\n\"Any time my family and I would move, the desi store (local South Asian store) would be the first place we would locate in our neighbourhood,\" says culinary consultant Ismat Awan. \" It was like stepping into a place of familiarity, with the faint scent of agarbatti (incense) and the rows of organised chaos including bags of spices and boxes of Shan masala [a well-known Indian brand] lining the shelves, instantly finding a place in our baskets and soon into our pantries. I think what made visiting these stores so important was their ability to help you settle into a new environment more comfortably.”\n\n\n\n\n\nA proud third-culture kid with Pakistani heritage and an Australian and Timor-Leste upbringing, Awan's journey mirrors her parents' experience when they first moved overseas. For her, these stores are a place for sourcing ingredients for her food styling and recipe development, or when a pang for the flavours of her childhood strikes – they feel like a treasure trove of memories.\n\n\n\nThe history of specialty grocery stores in Australia\n\nSpecialty grocery stores have a long history in Australia, first appearing in the 1920s during the Gold Rush when Chinese immigrants arrived seeking the promise of fortune. What followed was an influx of immigrants from around the world, and with them came their eating habits. Melbourne's Prahran Market – one of Australia's oldest – saw an explosion of migrant and fusion cuisines through the 1960s and 1980s, where Greek, Italian, Chinese and other ingredients began appearing regularly across grocery shelves.\n\n\n\nDong Nam A Brothers & Co has become a Chinatown fixture. Credit: Dong Nam A Brothers & Co In Sydney, stores like Dong Nam A Brothers & Co , which sells South East Asian groceries including Chinese, Vietnamese, and Malaysian products, and Thai grocery Chang Thai Market Grocery , established in 1979 and 1985 respectively, represent the enduring appeal of such stores. In Melbourne, the Makool family established Middle Eastern grocer Oasis in 1998, and now three generations have worked to transform it into a cafe, gourmet grocery store, deli and fresh food market that welcomes people from all cultures.\n\n\n\n\n\nMore recently, Latin Deli was established in 2005 by Venezuelan entrepreneur Ben Ayala to supply the Latin community with nostalgic foods. Recognising its broader appeal, he expanded across Australia and New Zealand, aiming to share Latin culture while supporting those who have left their homes for new opportunities.\n\n\n\nFor food professionals like Ismat Awan, specialty grocery stores are like a treaure trove. Credit: Nic Gossage With over 1,000 Asian grocery stores and close to 480 Indian stores around the country, the number of specialty grocery stores in Australia is growing, alongside its immigrant population.\n\n\n\n\n\nMost towns now have at least one Asian grocer, while larger cities like Sydney and Melbourne support more niche outlets, including dedicated stores for Japanese, Thai, Korean and Nepalese communities. What was once only found in major cities has now spread to regional areas, as new groceries continue to open to serve Middle Eastern, European, and African communities in smaller towns looking for authentic ingredients.\n\n\n\n\n\nThese stores are often owned and operated by families honouring their heritage, weaving together the stories and traditions of their past to create connections with a new country they now call home.\n\n\n\n\n\nGong Grocer , one of Sydney's best-known Asian supermarkets reflects this family-driven approach. Named after the late patriarch of the family known as 'Ah Gong,' the current owners feel a deep generational responsibility to carry on his story.\n\n\n\n\n\n\"Our store exists not only to preserve heritage, but to proudly share it with customers from all generations and backgrounds, offering a space where people feel seen, connected, and celebrated,\" says Brian Nguyen, Managing Director of Gong Grocer. \"It's a space that reflects the heart of family, and proudly celebrates Asian culture in all its richness and complexity.\"\n\n\n\nWith offerings spanning Chinese, Vietnamese, Thai, Indonesian, Japanese and Korean products, the team behind Gong Grocer seeks to recreate the experience of shopping at markets back in Asia.\n\n\n\n\n\nSimilarly, Radhe , an Indian grocery established by the Patel family is a family-run store. Moving from India in 2001, the Patels found a gap in the market for younger generations to access well-priced, accessible Indian groceries.\n\n\n\n\n\n\"We often hear from parents visiting their children in Australia that they can find everything they need here. They note they don’t quite miss India as much when they visit our store, and that feeling of creating a home away from home is incredibly fulfilling,\" says co-owner Ketan Patel.\n\n\n\n\n\nFrom clay diyas (oil lamps) used during festivals like Diwali , to specialty items from regional India like roasted vermicelli, gram flour, and nostalgic staples like boxes of Tata tea next to milk rusk and Parle G biscuits, Radhe has grown to stock not just food supplies, but also traditional homeware and skincare products from the Indian subcontinent. It's both a nod to the growing Indian population in Australia and a genuine appreciation from locals for different facets of the cuisine.\n\n\n\nShaping the future\n\nSpecialty grocery stores are not just cultural capsules, but also time capsules for migrants in Australia. For us, it might mean finding the ingredients our parents and grandparents once used, or discovering the stories behind traditional dishes cooked on special occasions.\n\n\n\n\n\nDespite being rooted in the past, these stores are creating a culturally relevant space for many second and third-generation immigrants too. They have seen significant growth among Australian customers who are increasingly curious and experimental with food, whether they're recreating viral dishes seen on social media, or participating in food tours in suburbs like Sydney’s Harris Park or Cabramatta to learn about immigrant cultures.\n\n\n\n\n\n“Since opening, we’ve seen our customer base grow into an incredibly diverse community. We continue to serve our core group of Asian-Australians and Asian immigrants, and we've witnessed a growing non-Asian customer demographic. Younger generations are returning to food as a way to explore their identity, and we’ve noticed a real desire for authenticity and convenience,” says Nguyen.\n\n\n\nSpecialty grocery stores are not just cultural capsules, but also time capsules for migrants in Australia.\n\nFor food professionals like Ismat who has collaborated with the likes of Adam Liaw , her work becomes about showcasing the enduring appeal of traditional flavours and introducing the timelessness of diverse cuisines to a broader audience.",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "17 of the greatest ramen recipes that bring Japan to your table",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/food/article/ramen-recipes/al2lxjl67",
      "published": "2025-07-31T10:43:20.709257",
      "content": "At its core, ramen is simple. But what makes ramen recipes so enduring, both in Japan and globally, is how infinitely customisable they are.\n\n\n\n\n\n“Ramen will usually have five elements,” says Adam Liaw on The Cook Up, “Noodles ( alkalined wheat noodles), toppings, soup, oil, tare.”\n\n\n\n\n\nThese parts form the foundation of Japan’s most iconic noodle dish – but ramen is so much more than the sum of its parts.\n\n\n\n\n\nIts roots trace back to China in the late 1800s, but by the 1950s ramen had become Japan’s ultimate fast food. Today, over 5,000 ramen shops operate in Tokyo alone.\n\n\n\n\n\nRegional styles reflect local produce and preferences. Sapporo’s miso ramen often features sweetcorn and butter, while Fukuoka’s creamy tonkotsu emerged during the wartime era when pork was more accessible than other meat. Broadly, ramen falls into five main categories: tonkotsu (pork bone), miso, shoyu (soy sauce), shio (salt), and abura soba or mazemen (brothless). Each has its own techniques, textures and toppings.\n\n\n\n\n\nWhile traditional ramen can take years to master, these easy recipes offer accessible ways to bring its depth and character to your own kitchen, whether you’re after a quick fix or something slow-simmered and soulful.\n\n\n\nBuilt from scratch, this classic ramen recipe is a love letter to Tokyo’s classic shoyu style. Every element – broth, tare, pork, egg, noodle – is homemade, making it as much a cooking journey as it is a satisfying meal. Shortcut if you need with store-bought ramen noodles.\n\n\n\nCredit: Alana Dimou\n\nInspired by Chinese tantanmen but grounded in Japanese ramen technique, this recipe from Marion Grasby layers sesame paste, soy milk and spice with toasty roast chicken for a shortcut to flavour depth.\n\n\n\nCredit: Sippakorn Wongthanapa\n\nDuck richness and scallop sweetness make this ramen a textural and flavourful journey. A special-occasion bowl that feels both quietly luxurious and soulful.\n\n\n\nCredit: Alan Benson\n\nThis miso ramen is a warming and hearty match for Sapporo’s snowy winters, with sweetcorn and butter often stirred in for local flair, richness and a savoury-sweet contrast.\n\n\n\nCredit: Chris Chen\n\nIf garlic is your love language, this is your ramen. A name like 'The vampire slayer promises punch' – and with 44 cloves of garlic, this ramen delivers. If the clove count sounds daunting, fear not, they're is deliciously dispersed between a slow-roasted pork belly, fried garlic powder and a togarashi and garlic-infused oil. Balanced by creamy soy sauce, this a modern, full-throttle bowl of ramen noodles built for bold palates.\n\n\n\nThe vampire slayer ramen express Credit: Mandy Lee\n\nSweet corn and mellow leek offer a lighter, vegetarian-friendly take on classic Sapporo ramen that’s still delivers comfort.\n\n\n\nFamous for its creamy, opaque broth, tonkotsu ramen earned cult status in Fukuoka before spreading nationwide. This version builds layer upon layer – pork loin, miso, sesame, and more – for a ramen that’s rich, restorative and worth every minute. Originating in Kyushu, this style reflects the slow, methodical approach behind many of Japan’s most iconic dishes.\n\n\n\n‘Soba’ in this context refers to the noodle format, not buckwheat noodles – it’s ramen-style wheat noodles served without broth, just a seasoned oil-based sauce. Created in postwar Tokyo, abura soba is thought to have emerged in the 1950s as a cost-effective, efficient dish when broth was expensive or impractical.\n\n\n\nCredit: Alana Dimou\n\nMeaty mushrooms, chilli heat and layered umami make this a standout vegetarian ramen. Big on flavour, low on compromise, perfect for cool evenings.\n\n\n\nCredit: Alan Benson\n\nThis ramen leans on kombu, soy and shiitake to create rich depth – proof that vegan ramen can hold its own in any lineup.\n\n\n\nVegan ramen. Credit: Freshly Picked with Simon Toohey\n\nThis recipe proves vegetarian ramen doesn’t need hours to deliver complexity. Miso, fermented chilli bean paste and shiitake form the flavour base, while simmering the corn cob adds natural sweetness. Built in a wok, finished with butter, it’s a speedy take on Hokkaido’s miso ramen traditions.\n\n\n\nCorn miso ramen Credit: Kitti Gould\n\nTofu adds heartiness while furikake layers crunch and savoury zing to this vegan ramen. A great choice when you want something fun, filling and weeknight-friendly.\n\n\n\nSpicy tofu ramen with furikake Credit: Kitti Gould\n\nA summer favourite in Japan, hiyashi chuka is cool, colourful and built for the heat. Think ramen, but salad-style – chilled ramen noodles get an iconic rainbow layer of slivered toppings and a bright vinegar dressing, in a dish that refreshes as much as it satisfies.\n\n\n\nCredit: Alana Dimou\n\nThis creamy chicken ramen gets its richness not from dairy but from long-simmered bones – similar to tonkotsu, but lighter, silkier and slightly sweet.\n\n\n\nCredit: The Chicken Soup Manifesto\n\nForget the broth, this Nagoya-born ramen style – Mazemen means 'mixed noodles' – is all about punchy, concentrated flavour. Dried shiitake and bonito powders bring instant umami, stirred through soy, oyster sauce and black vinegar. A raw egg yolk and hot oil finish turn this 10-minute dish into a silky, savoury standout.\n\n\n\nThis ramen doesn’t play by the rules: Caribbean jerk spice meets a Japanese classic but the result is serious comfort and warmth, with a novel take on the usual flavour profile complexity.\n\n\n\nJerk-rubbed chicken ramen noodle soup. Credit: Comfort Food With Spencer Watts",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Does vegan mean not enough protein? Not with these recipes!",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/food/article/high-protein-vegan-recipes/aer915ic6",
      "published": "2025-07-31T10:43:20.975992",
      "content": "Stream free On Demand On The Pulse episode • The Cook Up with Adam Liaw • cooking • 25m G episode • The Cook Up with Adam Liaw • cooking • 25m G\n\n\n\n\n\nWhether you're following a vegan diet , or just looking to add more high-protein plant-based meals to your week, these satisfying recipes are packed with ingredients that deliver both flavour and protein – think tofu , tempeh, lentils, chickpeas and nuts. From hearty curries to burgers, pasta bakes to salads, these high-protein vegan recipes are designed to satisfy.\n\n\n\nAdam Liaw channels classic ingredients of Spain into a robust one-pan meal ideal for weeknights and lunchbox leftovers. Smoked paprika, cumin and capsicum bring depth, while a handy can of four-bean mix adds protein and fibre. Serve with green olives for a hit of briny contrast. You won't miss meat at all!\n\n\n\nCredit: Jiwon Kim\n\nThis comforting vegan bake recipe layers al dente penne pasta with a double hit of creaminess: mashed chickpeas with hummus, and a soy milk bechamel. Chia seeds sneak in extra protein, while the herbed breadcrumb topping gives golden contrast, oven-finished until golden and bubbling.\n\n\n\nChickpea pasta bake. Credit: Freshly Picked with Simon Toohey.\n\nRajma is North Indian comfort food at its best: protein-packed kidney beans simmered slowly in a tomato and spice gravy until the flavours meld and the beans soften into perfection. This is one of the most satisfying vegetarian recipes to whip up for a weeknight meal.\n\n\n\nCredit: Jiwon Kim\n\nSocca, the chickpea flatbread from Nice in France, becomes the base for a meal that’s equal parts filling, fresh – and an ideal light meal for entertaining. A blended tofu-herb dressing adds extra protein and punch, transforming a side salad into something special.\n\n\n\nCredit: Mary Makes It Easy\n\nThis vegan ramen gets its savoury depth from dried shiitake mushrooms and kombu simmered in vegetable stock. A tahini-soy-chilli oil sauce sits at the base of the bowl, adding richness with every stir. Topped with smoked tofu, garlic oil, and seared bok choy, it’s an easy yet layered noodle soup that’s deeply satisfying.\n\n\n\nVegan ramen. Credit: Freshly Picked with Simon Toohey\n\nThese bean-based balls are a versatile addition to your meal rotation. Simmered in a robust tomato sauce, they pair well with spaghetti, crusty bread, or polenta. Packed with protein and flavor, they're a crowd-pleaser for both casual dinners and special occasions.\n\n\n\nCredit: Savannah van der Niet\n\nWhen the craving for comfort hits, this creamy mushroom stroganoff delivers. Earthy mushrooms are simmered in a rich, dairy-free sauce, creating a hearty dish that's perfect over mashed potatoes or noodles.\n\n\n\nCredit: Mushrooms Australia\n\nMarinated in a sweet and savory sauce, the tofu absorbs the rich flavours, offering a satisfying alternative to traditional meat dishes. Serve it over rice with a side of kimchi for an authentic touch.\n\n\n\nKorean bulgogi tofu Credit: Smith Street Books\n\nHearty, meaty and entirely plant-based, this walnut ragu proves you don’t need beef to make a bold pasta sauce. The blitzed nuts absorb flavour beautifully and create a texture similar to a slow-cooked mince.\n\n\n\nRich walnut ragu with pasta. Credit: Freshly Picked with Simon Toohey\n\nThis hearty curry combines tender cauliflower with protein-rich split peas in a fragrant coconut milk base. Infused with spices, it's a comforting dish that's both nourishing and flavorful. Perfect for a cosy night in, it pairs well with rice or naan.\n\n\n\nCredit: Plum Books / Jeremy Simons\n\nHearty and wholesome, this plant-based chilli makes for a vegan protein-packed meal. Spiced to perfection, it's a warming dish that's ideal for meal prep or feeding a crowd. Top with avocado and coriander for freshness.\n\n\n\nCredit: Savannah van der Niet\n\nThis soupy dhal gets its richness from coconut milk , yellow split peas and an aromatic freshly made curry paste. Soothing, gently spiced, high in protein and low on fuss – it’s a warming bowl you’ll want to make on repeat.\n\n\n\nTony Tan's dhal. Credit: Mark Roper / Murdoch Books\n\nBuckwheat soba bring nutty depth to this cold noodle salad tossed in creamy peanut dressing. Add crunchy greens and tofu, and it’s lunch that energises or dinner that nourishes. Cool, crunchy, and quick to assemble.\n\n\n\nVeggie soba noodles with peanut dressing Credit: Desiree Nielsen\n\nThis dairy-free twist on carbonara uses blended cashews to mimic the creamy richness of the original. Smoky shiitake \"bacon\" adds a savoury depth that plays perfectly with the silky sauce and al dente pasta.\n\n\n\nChickpeas and breadcrumbs form the base of these golden, pan-fried croquettes, but the surprise? A sharp-sweet pickle centre that cuts through every bite.\n\n\n\nPickle-filled chickpea croquettes. Credit: Freshly Picked with Simon Toohey\n\nFul medames – Egypt’s beloved fava bean breakfast – is rich and satisfying, with a garlicky tahini drizzle over slow-simmered fava beans. Traditionally eaten for breakfast, it also makes an excellent anytime bowl of sustenance.\n\n\n\nFul medames (slow-cooked broad beans with tarator, dill and pickled cucumbers) Credit: Andrew Dorn\n\nThese vegan chilli dogs don’t hold back on boldness – veggie hot dogs are topped with bold and smoky bean chilli, a cashew-based velvety vegan cheese sauce, and all the classic hot dog condiments to deliver satisfaction without the meat.\n\n\n\nCredit: Mary Makes It Easy\n\nThis Indonesian vegetable curry with tempeh is gentle, grounding and generous. Think of it as your midweek meditation in a bowl: creamy coconut broth, earthy tempeh, soft veg and a whisper of spice.\n\n\n\nNeed a reliable dinner that hits the spice, fibre and protein trifecta? This chickpea masala comes together with pantry staples and a bag of spinach – no fuss, no meat, just depth and comfort.\n\n\n\nCredit: Parveen's Indian Kitchen\n\nThink tofu’s boring? Not when it’s deep-fried and drenched in sweet-savoury peanut sauce – this beloved Indonesian street snack is ready in minutes and vanishes even faster. Serve it with cucumber or bean sprouts for crunch. A crowd-pleaser, every time.\n\n\n\nDeep-fried tofu with peanut sauce Credit: China Squirrel\n\nA staple across Turkish households, mercimek köftesi are vegan, protein-rich and perfect for an appetiser for entertaining, for lunchboxes and picnics. Serve with cos lettuce leaves to wrap and lemon wedges to squeeze over.\n\n\n\nCredit: Sharyn Cairns\n\nDubu jorim is Korean comfort food at its simplest: tofu simmered in a punchy soy-garlic broth until every piece soaks up the savoury-sweet glaze. Delicious warm or straight from the fridge.\n\n\n\nCredit: Billy Law\n\nThese are freezer-friendly, flavourful, and packed with vegan protein from walnuts and lentils. A party hit or a smart lunch prep move.\n\n\n\nCredit: Savannah van der Niet\n\nForget faux meat – this dish leans on umami-rich portobellos and silky bean mash for a main that feels indulgent and satisfying. The kind of food you want to linger over.\n\n\n\nCredit: Ebury Press\n\nThis two-patty vegan high-protein burger does more than mimic – it delivers. With a zippy 'secret sauce', shredded lettuce and plenty of veg-protein oomph and sesame seed bun, it’s a nostalgic nod that doesn’t compromise on flavour, crunch or cheeky joy.\n\n\n\nCredit: Zacchary Bird\n\nMarinated in plant-based buttermilk and dredged in seasoned flour, this fried tofu delivers crunch, spice and serious satisfaction. A must-try for anyone sceptical about tofu’s potential. Pair with your favourite hot sauce.",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Episode guide | The Cook Up with Adam Liaw Season 8 | Episodes 57 to 65",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/food/the-cook-up-with-adam-liaw/article/episode-guide-the-cook-up-with-adam-liaw-season-8-episodes-57-to-65/yc0jyrcfe",
      "published": "2025-07-31T10:43:21.060186",
      "content": "--- Watch The Cook Up with Adam Liaw weeknights on SBS Food (Ch.33) at 7.00pm. Stream all episodes anytime at SBS On Demand . ---\n\n\n\nStream free On Demand The Cook Up with Adam Liaw series • cooking PG series • cooking PG\n\n\n\n\n\nWhether you need simple weeknight winners or elaborate dishes to delight, The Cook Up has the goods to help you reach culinary greatness.\n\n\n\n\n\nSeason 8 features memorable chefs and cooks, along with notable names from sports, entertainment, and the arts—offering plenty of dinner inspiration and entertainment on SBS Food and SBS On Demand. Cooking meets entertainment in the perfect blend of food, chat and laughs as Adam is joined each night by two guests and their recipes matched to a different theme.\n\n\n\n\n\nEpisode 57 | Easy & Slow\n\n\n\nAirs 7:00pm Monday 21 July on SBS Food\n\n\n\n\n\nIf you need low-effort, high-reward recipes, look no further than these dishes from Adam, chef Shane Delia and Paralympic champion Vanessa Low OAM.\n\n\n\nEpisode 58 | Snack, Crackle & Pop\n\n\n\nAirs 7:00pm Tuesday 22 July on SBS Food\n\n\n\n\n\nTop chefs Pingping Poh and Matías Cillóniz join Adam to make snacks with a bit of crackle and a bit of pop.\n\n\n\nEpisode 59 | True Blue Tastes\n\n\n\nAirs 7:00pm Wednesday 23 July on SBS Food\n\n\n\n\n\nDessert dynamo Terri Mercieca and food historian Dr. Lauren Samuelsson join Adam to advance Australian fare with some true blue tastes.\n\n\n\nCredit: Jiwon Kim Episode 60 | On the Pulse\n\n\n\nAirs 7:00pm Monday 28 July on SBS Food\n\n\n\n\n\nChickpeas, please! The King of Hummus, chef Tom Sarafian, joins comedian Tegan Higginbotham and Adam to make recipes that are on the pulse.\n\n\n\nEpisode 61 | Go Fish\n\n\n\nAirs 7:00pm Tuesday 29 July on SBS Food\n\n\n\n\n\nIt’s a game of go fish where everyone wins, as Adam, chef Rosy Scatigna and performer/cook Paul Mercurio make their favourite fish dishes.\n\n\n\nEpisode 62 | Well Bowled\n\n\n\nAirs 7:00pm Wednesday 30 July on SBS Food\n\n\n\n\n\nThrow out your plates! Adam and two of Australia’s most well-regarded chefs, Mark Olive and Warren Mendes, have three recipes that’ll have you saying, “well bowled”.\n\n\n\nCredit: Jiwon Kim Episode 63 | Signature Chicken\n\n\n\nAirs 7:00pm Monday 4 August on SBS Food\n\n\n\n\n\nYou’ll want to sign your name to all three signature chicken recipes made by Adam and his guests, comedian Becky Lucas and food sensation Marion Grasby.\n\n\n\nEpisode 64 | Natsukashīi - Nostalgic Japanese\n\n\n\nAirs 7:00pm Tuesday 5 August on SBS Food\n\n\n\n\n\nFollow Adam and his guests, chef and entrepreneur Yumi Nagaya and comedian Takashi Wakasugi, down memory lane as they make natsukashīi – nostalgic Japanese food!\n\n\n\nEpisode 65 | Salty & Sour\n\n\n\nAirs 7:00pm Wednesday 6 August on SBS Food\n\n\n\n\n\nChef Tom Hitchcock and comedian Urvi Majumdar join Adam to unleash the power of salty and sour food.",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "23 great recipes where honey plays a starring role",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/food/article/best-honey-recipes/lbjsd45v9",
      "published": "2025-07-31T10:43:21.173204",
      "content": "Stream free On Demand A Girl's Guide to Hunting, Fishing and Wild Cooking series • cooking PG series • cooking PG\n\n\n\n\n\nHoney has been harvested for thousands of years, and with its floral sweetness, natural acidity and complex depth, appears in cuisines from Egypt to China – as both a quiet accent and a bold lead. Its magic often lies in contrast: meeting salt, fat, fire or spice to unlock unexpected dimensions. Whether baked over cheese, stirred through marinades or paired with smoke and citrus, honey has many moods.\n\n\n\n\n\nIt is such a powerful ingredient that renowned chef Analiese Gregory even embarks on a beekeeping journey to be able to harvest her own honey in her Tasmanian farming journey, as documented in A Girl's Guide to Hunting, Fishing and Wild Cooking .\n\n\n\n\n\nIf you're looking for a sweet treat with honey, be sure to check out the sweetest ways to cook with honey , or if you're interested in finding out how to substitute sugar for honey, here are some great tips .\n\n\n\n\n\nBut in the meantime, here are some of the greatest recipes, from savoury dishes to cocktails, in which honey is so much more than a sweet touch.\n\n\n\nA botanical twist on a classic prohibition cocktail – lemon verbena and honey give this gin drink lift, perfume and a honeyed linger. This elegant version concocted by Analiese Gregory feels both vintage and modern.\n\n\n\nCredit: A Girl's Guide To Hunting Fishing and Wild Cooking\n\nA breakfast that leans into texture and native flavour – sweet-tart quandong, creamy mango, and the crunch of honeyed nuts over warm oats.\n\n\n\nCredit: Steen Vestergaard\n\nPerfect for a family huddle-around-the-table meal, this honey chicken delivers warm sweetness and tender texture, no fancy ingredients required — just a marinade, batter and honey sauce to finish.\n\n\n\nCredit: Sippakorn Wongthanapa\n\nA throw-together dinner that delivers big: salmon fillets bathed in a honey-garlic glaze, broiled to caramelised perfection. Impressive on the plate, easy on the effort.\n\n\n\nHoney garlic salmon Credit: Kitti Gould\n\nImagine melting feta with honey drizzle and chilli flair, then scooping it onto fresh bread. It’s a simple but show-stopping starter that keeps everyone coming back for more. This dish is party-ready.\n\n\n\nCredit: Penguin Books / Nadiya's Everyday Baking\n\nFast, fresh and zingy – this stir-fry is all about speed and brightness. Honey tempers the lime, while prawns soak up the sweet-sour glaze.\n\n\n\nCredit: Jiwon Kim\n\nChristmas or not, this bourbon-honey glaze is worth turning on the oven for. The cloves perfume every slice, while the sticky crust begs to be sneakily picked at when no one's watching.\n\n\n\nThis dish is sunshine on a plate – ideal for when fruit is at its peak and you want something beautiful without turning on the oven. A bright, effortless dessert or brunch plate with creamy ricotta, tart-sweet fruit and honey to tie it all together.\n\n\n\nCredit: Ben Fogarty\n\nSalty, spicy sobrassada and sweet honey form an unexpectedly addictive combo on crusty toast. It’s the kind of breakfast that feels like a treat but takes minutes. A nod to Mallorcan flavours, this dish leans on contrast: hot and cold, sweet and spicy, soft and crisp.\n\n\n\nOlive oil, sobrassada and honey on toast Credit: Rochelle Eagle\n\nThese North African-style meatballs wrap lamb, saffron and honey into one fragrant, satisfying dish. Perfect for feasting, or freezing ahead.\n\n\n\nCredit: China Squirrel\n\nThese ribs pack heat and sweet in equal measure. The honey glaze tempers the smoke and spice of chipotle, leaving you with sticky, fall-apart meat.\n\n\n\nCredit: Pati's Mexican Table\n\nThe contrast of fried cheese and honey never gets old. Here, salty pecorino meets hot oil and comes out golden and gooey. A drizzle of honey and herbs makes it more than just a cheese snack – it’s a surprisingly satisfying starter.\n\n\n\nCredit: Adam Liaw\n\nThis recipe adds complexity without effort. Honey softens the peppery bite, bringing balance to a robust, quick-fire steak. Smoky, sweet, and slightly floral, with just the right amount of saltiness from the soy sauce.\n\n\n\nCredit: Outback Gourmet\n\nA Jewish classic where carrots are braised low and slow in honey until glossy, tender and festive-feeling.\n\n\n\nA proper dinner-party dish – rich pork loin gets a sticky glaze and salty blue cheese hit, brought together by the subtle sweetness of honey.\n\n\n\nPork loin with stilton and port and honey glaze Credit: Donna Hay: Fast, Fresh, Simple\n\nThis recipe makes haloumi the star, pairing its salty squeak with floral honey, lemon and nutty buckwheat for a clever side or light main.\n\n\n\nCredit: Benito Martin\n\nSticky-finger food done right – these ribs lean into sweet, herbal and liquor warmth for a standout dish that blurs the line between rustic and refined.\n\n\n\nSlow-roasted lamb spare ribs with thyme honey and ouzo glaze. Credit: Alpha\n\nFamily-friendly but not dull, this one-pan dish leans on mustard and honey for punch, peas for sweetness – and delivers perfectly glazed chicken with barely any cleanup.\n\n\n\nCredit: Jiwon Kim\n\nBrie needs no introduction, but add warm honey and toasted nuts and you’ve got a starter that is rich, gooey and always a hit. This recipe makes maximum impact with just a few ingredients.\n\n\n\nCredit: Jiwon Kim\n\nHoney gives this bread a mellow edge and helps keep it tender. Great for baking on a quiet Sunday, with leftovers for the week.\n\n\n\nCredit: Martha Bakes / Yossy Arefi\n\nCrispy eggplant rounds glazed with a honey infused with aromatics like black peppercorns, fennel and bay – this is rustic Italian snacking at its best. A scattering of fried rosemary leaf adds a herbal savoury lift.\n\n\n\nCredit: Benito Martin\n\nScottish heather honey brings floral depth to this golden-skinned chicken, which roasts until the sweetness turns to savoury caramel. Gently perfumed, it’s a Sunday roast with a subtle twist.\n\n\n\nCredit: Chris Chen\n\nThis Sardinian treat tucks tangy cheese into pastry, then fries it and drizzles it with honey. It’s a sensory rollercoaster: crunchy, creamy, salty and sweet.",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "The real story behind the invention of Aussie icon, the humble chicken salt",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/food/article/chicken-salt/h21d2v22c",
      "published": "2025-07-31T10:43:21.206051",
      "content": "For decades, Australians have reached for chicken salt when looking for a pop of flavour – we’ve sprinkled it onto chips , over roast chooks and even used it to season margaritas .\n\n\n\n\n\nIn fact, this particular seasoned salt has even helped save lives. In 2019, a customer’s request for this condiment diverted a fish and chip worker away from the deep-fryer – just as a car slammed through the Sunshine Coast shop’s kitchen. \"The guy pretty much saved her life by ordering that extra chicken salt,\" store owner David Benjamin told 7News at the time.\n\n\n\n\n\nBut very few of us know about the origin story of this powerful, all-purpose flavour agent. It all started at Peter Brinkworth's chicken shop in Gawler, 40 km north of Adelaide, some time in the early 1970s.\n\n\n\nPeter Brinkworth invented chicken salt in his South Australian chicken shop. Credit: Salt of the Earth “When we were putting chickens on a spit … and sprinkling them with different condiments, I thought, well, this is a bit silly. Why don't I just make up one condiment to sprinkle on the chickens and give them a bit more flavour and appearance?” he tells SBS Food. At the time, he had no idea his invention would become this popular.\n\n\n\nHow chicken salt was originally made\n\nBrinkworth combined everything into a multispice blend. Each ingredient served a purpose: paprika gave the meat a warm shot of colour, for instance, while MSG (monosodium glutamate) boosted the taste.\n\n\n\n\n\n“Glutamate is what we find in matured cheeses, dark mushrooms, tomatoes. It's a very, very vibrant flavour. That’s the main thing that has made chicken salt what it was. MSG had that real flavour bomb,” he says.\n\n\n\n\n\nBrinkworth also ran a wholesale chicken business, and when local takeaway stores bought his chooks, he supplied them with chicken salt. One particular shop owner had a momentous revelation. “He said, ‘gee, that's good on chips!’ And it went from there.”\n\n\n\nChicken salt has evolved since its invention with different ingredients being experimented with – including dry chicken skin and seaweed. Credit: Jana Longhurst In 1979, Brinkworth sold his businesses to food manufacturing company Mitani – his chicken salt recipe was part of the deal. The company commercialised the product, launching it in supermarkets and takeaway stores far beyond Gawler. Mitani also adjusted the recipe (it’s now vegetarian, halal and MSG-free; while there’s no real reason to fear MSG in your food, Mitani uses yeast extract instead).\n\n\n\nChicken salt with a twist\n\nAfter selling his recipe, the chicken salt inventor noticed his creation becoming “the standard option” in takeaway shops. Its golden glow has also been remixed in many ways – in Melbourne, Central Park Cellars offers chicken-salt margaritas while Chotto Motto produces the seasoning with a vegan Japanese curry twist.\n\n\n\n\n\nWhen I interviewed co-owner Dylan Jones for my SBS podcast, Should You Really Eat That? , he discussed the seasoning’s national importance. “You know, being an Aussie, obviously I have chicken salt running through my veins,” he said.\n\n\n\nYet for many decades, Brinkworth’s identity as chicken salt’s inventor was unknown – until The Cook Up’s Adam Liaw unveiled him in The Guardian in 2018. Liaw was school friends with Brinkworth’s daughter, Jodie, and that led to the chicken salt creator publicly sharing his story for the first time and revealing his original recipe.\n\n\n\n\n\nLiaw was surprised the \"vibrant orange-yellow colour came from the addition of curry powder\", because its flavour isn’t that evident in the spice blend.\n\n\n\n\n\nThere’s a good reason why. There’s no curry powder in Brinkworth’s chicken salt. “I was pulling his leg,” he says and laughs.\n\n\n\n\n\nSo what’s actually in this seasoned salt?\n\n\n\n\n\n“The main ingredient, of course, is salt,” Brinkworth says. Then there’s chicken stock powder, MSG, paprika, garlic, onion and celery. “I put a bit of rice flour in it these days as a stabiliser to stop it clumping in the jars. But that's basically what's in it.”\n\n\n\nThe inventor still makes the OG chicken salt from scratch himself. Credit: Salt of the Earth The 84-year-old still makes jars of chicken salt today, and they can be purchased the old-fashioned way – his salt is available from the honesty box near his Adelaide home, the back of his car and online , too.\n\n\n\n\n\n“I put it on just about everything. We have it on our eggs for breakfast,” he says. “On a steak or red meat, it’s particularly good.”\n\n\n\n\n\nHe’s currently working on a vegetarian “white salt” version optimised for bechamel sauce, mashed potatoes and pasta dishes that don’t need that suntan-glow of chicken salt.\n\n\n\nChicken salt goes global\n\nWhile chicken salt hasn’t yet captured the world's attention quite like, say, avocado toast, Aussies have been spreading the word overseas.\n\n\n\n\n\nIn New York, Thomas Lim created a high-end version at Dudley’s Deli, while comedian Andy Lee’s pub, Old Mates, dusts its chips in this seasoned salt. In 2022, Jacob Richardson and Thomas Van Kalken launched their film about Brinkworth, Salt of The Earth ; it’s played in Egypt, the Czech Republic, France and the US, where it won Best International Documentary at the Florida Shorts Film Festival.\n\n\n\n\n\nPerhaps this will help rev the international appetite for chicken salt, which was first stoked over 30 years ago, when Brinkworth delivered chicken salt to some Canadian farmer friends?\n\n\n\n\n\nMeanwhile, closer to home, Brinkworth is still taken by surprise with his unintentional fame. He laughs that his grandson told him he was “a national icon” the other day. “He’s 11 years old!”",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "Superfoods that are also super tasty",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/food/article/superfood-recipes/suc1ccqde",
      "published": "2025-07-31T10:43:21.422484",
      "content": "Stream free On Demand Jamie's Super Food series • cooking PG series • cooking PG\n\n\n\n\n\nWhen you think of the term superfoods, you might think of ingredients such blueberries , chia seeds and kale . And indeed, those three often commonly appear on superfood lists. But as Jamie Oliver says in his series Jamie's Super Food , eating superfood doesn't have to be about throwing in a few (sometimes very expensive) ingredients into your bowl or blender. Eating 'super food' can be an everyday thing, and delicious too.\n\n\n\n\n\nBut first, what exactly are superfoods? While the term superfood usually refers to food that are rich in nutrients, and sometimes with proven or potential health and wellbeing benefits, there's no formal definition, and the evidence doesn't always match the marketing hype. But there's plenty of evidence that including a wide range of nutritious food in your diet is good for you, and that's the approach Oliver takes.\n\n\n\n\n\n\"Super food for me is a new way of thinking,\" he says. \"It’s not about goji berries and green drinks. It’s about cooking smart with simple foods that are nutritious and delicious.\"\n\n\n\n\"I don’t want you to eat healthy food because you have to. I want you to eat healthy food because it’s delicious.\"\n\n\n\n\n\nHere are 11 easy recipes from Jamie Oliver and other great cooks that show just how good food that is good for you can be.\n\n\n\nJamie Oliver's Asian-inspired crispy lean beef stir-fry with brown rice noodles, plenty of salad and a zingy ginger and chilli dressing is full of texture and flavour. \"This is absolutely the kind of stuff I love to do in the middle of the week. You can knock it out quick. Makes you feel good,\" he says. \"Healthy food doesn’t have to be boring. This is full of texture, colour, flavour.\"\n\n\n\nStir-fried crispy beef with noodles and salad. Credit: Jamie Oliver Enterprises\n\nHere's a prime example of food that looks delicious, tastes delicious and is good for you too. And it's not hard to make. \"This delicious combo of fresh fish, whole wheat tacos and amazing kiwi and lime salsa is protein packed, low in fat and has three of your five fruit and veg a day,\" Oliver says of a Jamie's Super Food recipe inspired by his visit to the Nicoya Peninsula in Costa Rica, home to people with some of the highest longevity on earth, and where fish plays an important part in the local diet.\n\n\n\nTasty fish tacos. Credit: Jamie Oliver Enterprises\n\nHere, Jamie Oliver gives eggy bread – \"one of my favourite breakfasts as a kid\" – his 'super food' twist. \"And the thing is about this dish is it can skew unhealthy, or really healthy.\" His version tilts to the latter. Usually, eggy bread (pretty much French toast!) is made by soaking white bread slices in an egg and milk mixture and then frying the slices in butter or oil. Oliver changes things up by using thick slices of wholewheat bread, cutting a pocket into each and stuffing it with fruit, then using a spiced egg and banana mixture for dipping. A small amount of oil is used for cooking, and the cooked stuffed products are served with natural yoghurt and nuts.\n\n\n\nJamie's eggy bread berry pockets. Credit: Jamie Oliver Enterprises\n\n\"Protein packed prawns, smothered in a punchy marinade, resting on a pile of whole wheat couscous. Fruit and veg with capsules of pomegranate providing bursts of sweet joy. This is one sunny celebration of food you won’t wanna miss out on,\" says Oliver of this vibrant meal from Jamie's Super Food . It's also ready in about 20 minutes, making this a whole different kind of fast food!\n\n\n\nSizzling Moroccan prawns with couscous and rainbow salsa. Credit: Jamie Oliver Enterprises\n\nIrish cook Donal Skehan is another person who loves filling a plate or bowl with approachable, healthy food. Here, he serves up a healthy dinner with a spiced BBQ fish fillet served alongside a wild rice, chickpea and asparagus salad and dressed with mango salsa.\n\n\n\nCredit: Donal's Cook, Eat, Burn\n\nThis vibrant Jamie Oliver recipe with eggs, beans, cherry tomatoes and ricotta makes a delicious, protein-rich breakfast or brunch.\n\n\n\nBaked eggs in popped beans with ricotta toast. Credit: Jamie Oliver Enterprises\n\nSupercharged with spinach, these pancakes are quick and colourful. \"Having fun with breakfast is definitely something we can do more of, and this is a really beautiful breakfast, brunch, lunch...,\" Oliver says. \"It's full of colour, full of the good stuff.\"\n\n\n\nSpinach pancakes with blistered tomatoes. Credit: Freshly Picked with Simon Toohey\n\nIf a sweet breakfast is more your style, you'll love these rice puddings from Jamie Oliver. Colourful and delicious, they can be made ahead, too, and stored in the fridge. With mango, banana, passionfruit, coconut flakes and hazelnuts in there, it's bringing variety to your morning.\n\n\n\nBlack rice breakfast pudding. Credit: Jamie Oliver Enterprises\n\nAnother colourful bowl, this one from Jacqui Tedder. \"This salad is a homage to the forgotten superfoods. The humble underdogs, like the sweet potato, which contains more beta carotene than a carrot, and the cauliflower, which contains plant sterols that help to lower the 'bad' cholesterol naturally,\" she says.\n\n\n\nCredit: Nikki To\n\nBring the healthfood cafe to your kitchen with this Donal Skehan recipe – a big beetroot patty filled with various veg, chickpeas and oats served on a sourdough bun with sliced avo, cabbage and hummus.\n\n\n\nMega beetroot burger Credit: Donal's Cook, Eat, Burn!\n\nSuper crunchy and packed with a great variety of nuts, seeds and grains, including buckwheat, quinoa and oats, these bars are a tasty energy source after a hard workout or a long walk, or for a relatively healthy snack. As Caroline Griffiths notes, it might seem a bit weird to include cumin in a non-savoury recipe, but it gives a slightly unusual edge to these bars.",
      "frequency": 1
    },
    {
      "topic": "lifestyle",
      "title": "‘Stick with it’: Greg Inglis leads national mental health push for mob",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/nitv/article/stick-with-it-greg-inglis-leads-national-mental-health-push-for-mob/t49oytcoz",
      "published": "2025-07-31T10:43:34.017205",
      "content": "A powerful new mental health campaign is putting visibility, connection, and culture at the centre of healing – and it’s led by NRL great and Dunghutti man Greg Inglis.\n\n\n\n\n\nLaunched through his mental health organisation, the Goanna Academy, the Stick With It campaign invites people to write messages of strength, remembrance or hope on sports tape - a small gesture aimed at sparking big conversations.\n\n\n\n\"No matter what you’re going through – even if it feels tough or you’re not sure about the process – we want people to stay with it,” Inglis said.\n\n\n\n\n\n\"There’s always a light at the end of the tunnel.\"\n\n\n\n\n\nThe campaign comes as new figures show more than one in three Aboriginal and Torres Strait Islander adults report having a current mental health condition, a rate significantly higher than for non-Indigenous Australians.\n\n\n\n\n\nStanding in front of a mural in Redfern covered with hundreds of handwritten messages, Inglis reflected on the significance of making mental health visible.\n\n\n\nREAD MORE The mental health challenges facing queer mob\n\n\"We all bandage up injuries you can see - but mental health is invisible,” he said.\n\n\n\n\n\n\"This tape, these messages, they make it real. People wrote for the next person, someone they lost, or about their own struggles. It’s powerful.\"\n\n\n\nGreg Inglis places a message on a mural in Redfern covered with handwritten notes, part of the Stick With It campaign raising awareness for mental health in First Nations communities. The Stick With It initiative is part of a broader movement by the Goanna Academy to break down stigma in First Nations communities and to support young people through targeted education and cultural connection.\n\n\n\n\n\n\"I used to say I was okay, but I wasn’t,” Inglis said.\n\n\n\n\n\n\"Sharing my story helps others realise they’re not alone.\n\n\n\n\n\n\"We have to look after ourselves, so we can look after the next generation.\"\n\n\n\nREAD MORE First Nations mental health experts urge respectful dialogue ahead of Federal Election\n\nSouth Sydney Rabbitohs star and Bundjalung and Yuin man Cody Walker, an ambassador for the Goanna Academy, also threw his support behind the campaign.\n\n\n\n\n\n\"Mental health affects everyone – all communities, across the whole country,” Walker said.\n\n\n\n\n\n\"Seeing people come together to write messages for strangers – that could be the thing that helps someone get through the day.\"\n\n\n\n\n\nHe said campaigns like this are vital in communities where suicide rates remain alarmingly high.\n\n\n\n\n\n\"You never know what someone’s going through,” Walker said.\n\n\n\n\n\n\"But the Goanna Academy is giving mob the tools - strategies to work through mental health struggles, and ways to support others too. That’s what makes it so important.\"\n\n\n\nREAD MORE These Blak athletes have made history, crossing the finish line at IRONMAN Cairns\n\nThe campaign will also roll out across the NRL, with players set to wear Stick With It tape during Round 22 as a show of solidarity.\n\n\n\n\n\n\"It’s a great initiative, and I’m proud to be part of it,\" Walker said.\n\n\n\n\n\nThe Goanna Academy is aiming to raise $500,000 to expand its reach across schools and regional communities - enabling more programs, more ambassadors, and more sustained support.\n\n\n\n\n\n\"I don’t believe in just visiting a community once,” Inglis said.\n\n\n\n\n\n\"Mental health takes time. That’s why we return, we follow up, we build real connections.\"\n\n\n\n\n\nFor Walker, the message is simple: dream big, even through the struggle.\n\n\n\nREAD MORE This Gunnai and Gunditjmara man ran a marathon on all 7 continents to raise money for mob's mental health\n\n\"I always tell kids: follow your dreams,” he said.\n\n\n\n\n\n\"I’ve had my challenges, but I never gave up. That’s what this is about, showing people they’re not alone, and not giving up on themselves.\"\n\n\n\n\n\nAs NAIDOC Week continues across the country, Inglis said the campaign reflects what this year’s theme – 'The Next Generation: Strength, Vision & Legacy' – is all about.\n\n\n\n\n\n\"This is about legacy. This is about looking after ourselves so we can be here for the next generation,” he said.\n\n\n\n\n\n\"If we can change a life – or save one – then we’re doing our job.\"\n\n\n\n\n\n13YARN: 13 92 76\n\n\n\nLifeline: 13 11 14\n\n\n\nBeyond Blue: 1300 22 4636",
      "frequency": 1
    }
  ],
  "music": [
    {
      "topic": "music",
      "title": "Pretty Woman: The Musical is coming to Australia",
      "author": "Unknown",
      "source": "7News",
      "url": "https://7news.com.au/sunrise/pretty-woman-the-musical-is-coming-to-australia--c-19207298",
      "published": "2025-06-30T21:45:14+00:00",
      "content": "One of Australia’s favourite performers, Samantha Jade, will star as Vivian, in the upcoming Broadway and West End smash hit musical PRETTY WOMAN: The Musical, which makes its debut at QPAC Queensland Performing Arts Centre (QPAC) in Brisbane in October before debuting at Theatre Royal Sydney from November.\n\nBased on the iconic film, Samantha will play the role made famous worldwide by the much-loved Julia Roberts.\n\nSamantha Jade has been a household name in Australia for many years since winning Channel 7’s X Factor in 2012.\n\nKnow the news with the 7NEWS app: Download today\n\nShe has amassed a collective 91 million streams and 2.3 million sales worldwide, released a single with Pitbull (Shake That) and released her album NINE in 2015 which hit #2 on the ARIA charts.\n\nThe multi-talented Samantha has been a regular fixture on Australian television, starring as Kylie Minogue in the TV Miniseries INXS: Never Tear Us Apart, as well as an ongoing guest-starring role in Home & Away.\n\nShe has also toured with One Direction and Westlife and has headlined the Sydney Gay and Lesbian Mardi Gras twice.\n\nIn 2023, Samantha toured nationally with the Backstreet Boys and joined the cast of the second season of Celebrity Apprentice.\n\nMost recently, Samantha danced her way to the top as the runner-up of Channel 7’s 2024 Dancing With The Stars and released her infectious single Peachy.\n\nThe Broadway and West End smash hit musical PRETTY WOMAN: The Musical features music and lyrics by singer-songwriter Bryan Adams, alongside Jim Vallance.\n\nThe musical broke box office records at the Nederlander Theatre when making its Broadway debut in 2018 and has also wowed audiences in Spain, Italy, Poland and Germany as well as an extended West End season.\n\nOnce upon a time in the late ’80s, Vivian met Edward and her life changed forever. Be swept up in their romance in this dazzlingly theatrical take on a love story for the ages – and get to\n\nknow these iconic characters in a whole new way – in a sensational show that took London’s West End by storm, guaranteed to lift your spirits and light up your heart.\n\nWith a blazing rock score from GRAMMY® winners Bryan Adams and Jim Vallance (Summer of ’69, Heaven), direction and choreography by Tony Award® winner Jerry Mitchell (Kinky Boots, Hairspray) and a book by the original movie’s director Garry Marshall & screenwriter J.F. Lawton, a powerhouse creative team representing the best of music, Hollywood and Broadway ensures you’ll have a pretty magical time at PRETTY WOMAN: The Musical.\n\nBook your tickets for a trip to Rodeo Drive and get ready for a big night out. Big. Huge!\n\nQueensland Performing Arts Centre (QPAC) Lyric Theatre, Brisbane\n\nFrom 5 October 2025.\n\nTheatre Royal Sydney\n\nFrom 30 November 2025\n\nClick here for tickets.",
      "frequency": 1
    },
    {
      "topic": "music",
      "title": "Astronomer CEO resigns after viral kiss cam Coldplay concert incident",
      "author": "Unknown",
      "source": "7News",
      "url": "https://7news.com.au/news/astronomer-ceo-resigns-after-viral-coldplay-concert-incident-c-19413164",
      "published": "2025-07-19T21:19:41+00:00",
      "content": "Andy Byron, the chief executive of New York-based tech company Astronomer, has resigned from his role after he was spotted embracing an employee at a Coldplay concert, according to a LinkedIn post from the company on Saturday.\n\nAstronomer’s board of directors accepted Byron’s resignation, according to the LinkedIn post, and will begin searching for its next CEO.\n\nFollowing the viral video of Byron, alleged statements from Byron acknowledging the situation began to circulate online.\n\nKnow the news with the 7NEWS app: Download today\n\nAstronomer said in an earlier LinkedIn post that Byron “has not put out any statement” and “reports saying otherwise are all incorrect.”\n\nThat statement also addressed the misidentification of a third person seen in the clip circulating on the internet in the day following the video’s release.\n\nAstronomer did not immediately respond to CNN’s request for comment. CNN was unable to contact Byron for comment.\n\nOn Wednesday, Byron was seen with Kristin Cabot, the company’s chief people officer, on the “kiss cam” screen at Gillette Stadium in Foxborough, Massachusetts, before both ducked out of view.\n\n“As stated previously, Astronomer is committed to the values and culture that have guided us since our founding,” the company said Saturday.\n\n“Our leaders are expected to set the standard in both conduct and accountability, and recently, that standard was not met.\n\nThe data operations company, which was founded in 2018, acknowledged that “awareness of our company may have changed overnight,” but its mission would continue to be focused on addressing data and artificial intelligence problems.\n\nThe company on Friday said Astronomer’s co-founder and chief product officer Pete DeJoy would serve as interim CEO.\n\nByron’s LinkedIn account is no longer public and he was removed from the company’s leadership page following the announcement, which now lists co-founder DeJoy as CEO.\n\nByron is still listed on the company’s website as a member of the board of directors.",
      "frequency": 1
    },
    {
      "topic": "music",
      "title": "Are cost-of-living pressures and streaming platform algorithms killing Australian music?",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/news/article/australian-music-cost-of-living-pressures-and-streaming-algorithms/v1iiw53jg",
      "published": "2025-07-31T10:43:08.601668",
      "content": "Triple J's Saturday debut of its Hottest 100 of Australian songs has prompted many to reflect on the state of the local music industry — and the sobering reality that perhaps the biggest hurdle is cost.\n\n\n\n\n\nAn April report from Creative Australia found 62 per cent of Australians say music is really important to them — but cost is the main barrier to attending live shows.\n\n\n\n\n\nWhile 66 per cent said they want to hear more local music, many still prioritise saving up their dollars to see international acts — simply because they’re rarer.\n\n\n\n\n\nFBi Radio’s Tyson Koh says people tightening their hip pockets are having a direct flow-on effect on the industry, especially community radio, which has long been considered a cornerstone of the Australian music scene.\n\n\n\n\n\nFBi Radio — where Koh is managing director — has been an institution in the inner-Sydney suburb of Redfern since 2003, bolstered mostly by community memberships.\n\n\n\nBut in June, it had to cut half its permanent staff after entering a period of \"extreme financial distress\". It still isn't out of the woods.\n\n\n\n\n\n\"We found that in this brave new world of digital streaming and social media, a few people had taken our service for granted,\" Koh said.\n\n\n\n\n\n\"They were still listening to the station — but because they already had several other subscription-based services to keep up with, we'd gotten lost in the mix.\"\n\n\n\nTyson Koh says the cost of living crisis and growth of algorithmic music streaming is affecting community radio stations such as FBi, which could close its doors if not enough funding is secured. Source: Supplied / John Feder As cost-of-living pressures linger, Koh says discretionary spending — such as going to live gigs or subscribing to community radio stations — is becoming harder to justify.\n\n\n\n\n\n\"We really need our listeners to show up for us if we are to survive.\"\n\n\n\n\n\n\"I think we have to decide as a society whether music is important … if we can agree on that, then the question comes down to support and participation.\"\n\n\n\nLess disposable income, fewer ticket sales\n\nJoe Draffen, bassist for Melbourne band Floodlights, says the rising cost of living is also affecting artists.\n\n\n\n\n\n\"The current economic climate has made it harder to sell tickets, as many people just don’t have as much disposable income right now due to the rising cost of living,\" Draffen said.\n\n\n\n\n\n\"On top of that, our own expenses have gone up, which meant ticket prices had to increase too.\"\n\n\n\nMelbourne-based band Floodlights say the cost of living crisis has put pressure on musicians, leading to slower ticket sales and higher touring costs. Source: Supplied / Matt Shaw \"Touring’s gotten a lot more expensive — flights, accommodation, gear hire, crew — it all adds up.\"\n\n\n\n\n\nThe band has also been impacted by the closure of several music festivals across the country, which would typically bring more exposure and broaden their fan base.\n\n\n\n\n\nMore than 25 music festivals across Australia have been cancelled since 2022, according to data from the Australian Festival Association.\n\n\n\nCommunity-led efforts still not enough\n\nCaitlin Welsh and Joe Hardy run SydneyMusic.net, a manually curated gig guide born from the loss of local music press and the lingering effects of Sydney’s lockout laws.\n\n\n\n\n\nThe guide briefly shut down in June due to a lack of funds, before a flurry of one-off donations and sponsorships allowed Welsh and Hardy to keep going — for now.\n\n\n\n\n\n\"People hugely underestimate the amount of time and human labour it takes to manually research and compile the gig guide, as well as put together playlists and post daily lists to socials,\" Welsh told SBS News.\n\n\n\n\n\n\"It’s made by a small team of humans — including musicians and creatives who work with us as researchers — who need to be compensated for the amount of labour we’re all doing in order to continue living in one of the most expensive cities in the world.\"\n\n\n\nCaitlin Welsh and Joe Hardy founded gig guide SydneyMusic.net after frustrations with the diminishing Sydney music scene. But the cost of living is making it difficult for them to continue operating. Source: Supplied / Caitlin Welsh But live music spaces are becoming increasingly rare as venues face even more pressure to keep the doors open.\n\n\n\n\n\nIndia Wallis is a Brisbane-based musician and head of youth-focused record label Starving Kids, which runs a dedicated 150-capacity all-ages venue in Brisbane, serving musicians who are often booking their first show.\n\n\n\n\n\n\"The gap between local acts and established acts seems to be getting wider,\" she told SBS News.\n\n\n\n\n\n\"Brisbane is home to some great large-scale venues, but with more and more small venues closing, there are noticeably less opportunities for artists to cut their teeth.\"\n\n\n\nREAD MORE The $50,000 reason some Australian music festivals are calling it quits\n\nMore than 1,300 live music venues and stages across Australia have been lost since the COVID-19 pandemic, according to a 2023 report from music rights management organisation APRA AMCOS.\n\n\n\n\n\nWelsh added: \"Venues are being bled by insurance premiums and rent and the alcohol excise, and they can’t afford to run all-ages shows because they rely on bar sales to support putting on music at all, and punters can’t afford to buy as many drinks as they used to because their rent is too damn high.\"\n\n\n\n\n\n\"The narrowing of music participation to people who can afford to treat it as a hobby, or who are forced to accept poverty to keep doing it, is just as creatively flattening as the algorithm.\"\n\n\n\nAlgorithms placing pressure on industry\n\nAt the same time, streaming platforms such as Spotify are continuing to grow, with over nine million users in Australia. Date from market research firm Roy Morgan found Spotify had doubled its Australian user base between 2017 and 2020.\n\n\n\n\n\nSince 2017, the platform has moved towards algorithmically creating personalised music recommendations, informed by a user's listening history and preferences.\n\n\n\n\n\nKoh says this means that people are more likely to value platforms like these instead of community radio, which was traditionally a hub for music discoverability.\n\n\n\n\"People lead such busy lives, so the amount of time that people can devote to going on their own musical journey and discovering new artists is getting more and more limited,\" he said.\n\n\n\n\n\nKoh says this convenience is creating a \"giant homogenous culture\".\n\n\n\n\n\n\"One thing that social media and algorithms can't replace is the experience and joy of seeing a band. That's often where artists find their audiences and the people who they can take on the journey with them throughout their careers.\"\n\n\n\n\n\nDespite coming off their largest Australian tour so far, Floodlights say it’s become harder to be discovered organically — even in the midst of a breakout moment.\n\n\n\n\n\n\"There’s so much music coming out every day, and unless you’re backed by major playlists or algorithms, it’s easy to get lost in the noise,\" Draffen said.\n\n\n\nShould Triple J be doing more?\n\nIn the face of so many obstacles, musicians such as Ben Lee — who is expected to chart in Saturday's countdown for his hits Cigarettes Will Kill You and Catch My Disease — have called for the ABC's Triple J to do more to support Australian music, including restricting all Hottest 100 countdowns to only spotlight Australian songs.\n\n\n\n\n\n\"At a time when there are so many platforms for international music discovery, I just don't see the logic in a taxpayer-funded station using their platform to promote international acts, many on major labels,\" Lee told SBS News.\n\n\n\n\n\nHe said it was being run like a \"commercial station that's constantly bending over backwards to increase listenership\", primarily through bigger international artists. Lee added that it should move to play only Australian music across the board.\n\n\n\n\n\n\"They could single-handedly lead the way to revitalising the Australian music industry if they wanted to. But it would mean stopping thinking of themselves as a commercial radio station, but rather as a mission-driven government utility,\" he said.\n\n\n\n\n\nThe station has a mandated quota of 40 per cent for Australian music, but typically plays closer to the 50 per cent mark.\n\n\n\n\n\nLast week, Lee made similar remarks on both social media and to The Sydney Morning Herald.\n\n\n\n\n\nHead of Triple J Lachlan Macara told the Herald seeing local artists next to international names was what made the Hottest 100 \" so special\".\n\n\n\n\n\nHe said the program \"would love to see even more people and platforms supporting and prioritising Australian artists\".\n\n\n\nAustralian musician Ben Lee has called for Triple J to do more to support Australian music. Source: Getty / Martin Philbey But members of the industry are still conflicted over the best path forward.\n\n\n\n\n\nWhile Floodlights recently played their biggest headline shows across the country, Draffen said it’s still difficult to cut through without support from Triple J.\n\n\n\n\n\n\"We’ve really had to double down on staying connected with our audience and finding new ways to reach people but it's hard as Triple J doesn’t really play us, which obviously makes it tougher to reach a wider audience in Australia,\" he said.\n\n\n\nWallis said that while artists at her record label have seen \"great support\" from Triple J Unearthed, which features unsigned local acts, she wanted to see more.\n\n\n\n\n\n\"I strongly believe Triple J should be focusing more on a diverse range of homegrown acts, rather than commercial, international acts that already have a platform.\"\n\n\n\n\n\nWelsh agrees the Hottest 100 should be all-Australian each year, but stopped short of supporting that across the board. \"Nobody does more for Australian music than Triple J,\" she said. \"The ones who are letting down Australian music are the commercial stations … There has been zero accountability for commercial radio formats to meet their local music quotas.\"\n\n\n\n\n\nKoh agreed: \"We know that we're doing our bit, and I think Triple J does as well.\"\n\n\n\n\n\nFBi Radio also operates under a 50 per cent Australian music mandate, with half of that coming from Sydney.\n\n\n\n\n\n\"I think it's important to see Australian music in a global context and that local artists just don't exist in a silo.\"",
      "frequency": 1
    },
    {
      "topic": "music",
      "title": "How Fiston beat the odds to crack an $8bn Aussie industry and go global",
      "author": "Unknown",
      "source": "SBS",
      "url": "https://www.sbs.com.au/news/small-business-secrets/article/how-fiston-cracked-the-australian-music-industry-and-went-worldwide/3vh38dutj",
      "published": "2025-07-31T10:43:15.956792",
      "content": "At the mic in a small recording studio in Melbourne’s north, Fiston Baraka is putting the finishing touches on his new single.\n\n\n\n\n\n\"It’s called Kumbuka, which means remember,\" said Baraka, 25.\n\n\n\n\n\n\"It is about me looking back at times people told me to stop my music, that I was wasting my time. One line says, 'remember when they said I wouldn’t make it'.\"\n\n\n\n\n\n\"Making it\" is something the artist is incredibly proud of.\n\n\n\n\n\nThe rising hip-hop star from Geelong is among Victoria’s hottest music acts. He even performed at the Australian Open tennis tournament earlier this year.\n\n\n\n\n\n\"The Australian Open, yeah that was crazy, no way to describe it,\" he said. \"It made me feel seen and at the same time accept that the work I am doing is not going to waste.\"\n\n\n\nFiston Baraka performing at the 2025 Australian Open. Source: Supplied / GRID Series / Mark Peterson The recording studio is a world away from the refugee camp where Baraka grew up, but the memories remain vivid and live on in his songs.\n\n\n\n\n\nKnown to fans as Baraka the Kid, he sings in English and Swahili, and his rap music is finding an audience worldwide.\n\n\n\n\n\n\"My biggest following is Nigeria, South Africa, and the United States,\" he said. \"Australia sits at number four.\"\n\n\n\nCracking an $8bn industry\n\nBaraka is proud to contribute to the expanding Australian music industry, which grew in revenue by 6 per cent year-on-year in 2024, marking six consecutive annual gains, according to industry body ARIA.\n\n\n\n\n\nOverall, the Australian music industry generates revenues of $8.78 billion according to a recent report released by the federal government body Music Australia.\n\n\n\nIt provides the first comprehensive measure of the economic contribution of Australia’s music industry, and includes data from industry, government, and over 1,000 individuals and businesses working across the music industry.\n\n\n\n\n\nIt found that streaming dominates the market, accounting for more than 70 per cent of all revenue.\n\n\n\n\n\nIndustry growth provides opportunities for young artists, but music producer Ariel Blum said the playing field is far from level.\n\n\n\n\n\n\"There are a lot of challenges for people that don't grow up with either the economic means or the social networks to access the decision makers,\" Blum said.\n\n\n\n\n\n\"I have met many clients coming into the studio with a particular profile. They would typically come from privilege, economic privilege mainly, getting bills paid by mum and dad.\"\n\n\n\nFiston Baraka (left) remains in contact with co-founder Ariel Blum after his GRID Series mentoring. Source: SBS / Scott Cardwell It’s one reason Blum co-founded a music mentoring project called GRID Series in 2013, to give artists from disadvantaged backgrounds a helping hand.\n\n\n\n\n\n\"GRID is actually an acronym and stands for Grassroots in Development,\" he said.\n\n\n\n\n\n\"Our main mission is to bring resources, access, and opportunities to artists from low socioeconomic backgrounds.\n\n\n\n\n\n\"And in Australia, typically that means living in the outer suburbs or regional areas.\"\n\n\n\n\n\nFiston Baraka is among the project’s rising stars.\n\n\n\n\n\nSince being accepted into the project, he has received mentoring from Joel Ma, known as Joelistics, an Australian producer, multi-instrumentalist, and former member of the Melbourne-based Australian hip hop group TZU.\n\n\n\n\n\n\"When Fiston and I first met, he was really open to exploring his refugee story,\" said Ma.\n\n\n\n\n\n\"A lot of our conversation was about his family's story, coming from overseas and arriving in suburban Geelong, and how much of a cultural shock that was for Fiston and his family.\"\n\n\n\n'I learned English by watching cartoons'\n\nBaraka arrived in Australia in 2010 and was born in 2000 in Lubumbashi, the second-largest city in the Democratic Republic of Congo (DRC). He later grew up in a refugee camp in Zambia.\n\n\n\n\n\nZambia is home to more than 100,000 refugees, asylum seekers, and other displaced people. Many are exiles from the DRC.\n\n\n\n\n\nWhile Baraka has happy childhood memories of making friends there, he faced many hardships too. Food was short and illness rife.\n\n\n\nHis life changed dramatically when his parents bought a small parcel of land and started growing crops.\n\n\n\n\n\n\"Myself and my older brother were taken out of school and we started working on the farm alongside our cousins,\" he said.\n\n\n\n\n\n\"My parents decided the farm was more of a focus because that's what was actually bringing income,\" he said.\n\n\n\n\n\nIt set back his education, and when the family was finally accepted into Australia on humanitarian visas, Baraka had received limited schooling and spoke little English.\n\n\n\n\n\n\"The reading part was hard because I couldn't write and I couldn't read the words either,\" he said.\n\n\n\n\n\n\"So, the way I learned English was by watching cartoons on television.\"\n\n\n\n\n\nDrawing on the resilience many refugees are respected for, Baraka went on to finish high school and tertiary qualifications, spent six years working in construction then started his own music business.\n\n\n\nFiston Baraka (right) as a child with his family in Zambia. Source: Supplied / Fiston Baraka He now explores his refugee journey through song.\n\n\n\n\n\n\"It was not hard to kind of convince him to sing in Swahili,\" Ma said.\n\n\n\n\n\n\"We talked about whether that would alienate an Australian listening public. Our conversation got to a point of: 'well, the world is bigger than Geelong, bigger than Melbourne, bigger than Australia'.\n\n\n\n\n\n\"You can have an audience that extends to parts of Africa, America, Canada, and the UK because this story, although unique to you, is universal in so many ways.\"\n\n\n\n\n\nIt was a strategy that’s paid off for both artist and mentor.\n\n\n\n\n\n\"I get a huge rush of pride when I see someone like Fiston making their way in the world and having an impact and finding his audience. It is amazing,\" Ma said.\n\n\n\n\n\n\"I am very happy to be where I am and very proud to have [come] so far,\" said Baraka.\n\n\n\n\n\n\"I didn't think of music as being anything more than a hobby when I first started, but now it is a passion and something I can actually make a career out of, as well.\"\n\n\n\nChasing a dream\n\nBaraka is among 70 participants to develop their style and their business acumen through the GRID Series.\n\n\n\n\n\nThe free six-month program is supported by Creative Victoria, City of Greater Geelong, Creative Australia, Department of Local Government Sports and Cultural Industries (WA) and City of Casey.\n\n\n\n\n\nIt includes studio time with a producer, live performances and sessions on business basics.\n\n\n\n\n\n\"Things like setting up an ABN, registering your business name, claiming all of your profiles on different platforms, and registering for APRA AMCOS. Often they will come and do an information session, too,\" said Blum.\n\n\n\nHowever, Blum said Baraka’s motivation is also key to his success.\n\n\n\n\n\n\"Fiston is like a meteorite, a fireball of incredible energy. He is incredibly personable, incredibly talented, and insanely charismatic.\n\n\n\n\n\n\"And when you are around Fiston, you feel excited,\" he said.\n\n\n\nGRID Series currently runs in three states and aims to bring more diversity into Australia’s music scene.\n\n\n\n\n\n\"I come from a part of the Australian music industry that is about telling stories and representing an Australia, which is diverse,\" Ma said.\n\n\n\n\n\n\"And GRID is a hotbed of stories about an Australia that I recognise.\n\n\n\n\"In the past, the Australian music industry felt very white, very male-dominated, very rock-oriented.\n\n\n\n\n\n\"Because GRID is open-minded, it supports diverse artists and genres. Their music tells stories of people coming from other countries, particularly from war-torn countries and places where life is a struggle,\" Ma said.\n\n\n\n\n\nFor Baraka, who quit a full-time job in construction to chase his music dream, recent success is sweet, but his goal is to touch people through his songs.\n\n\n\nJoel Ma (right) is proud of Fiston Baraka's global success. Source: SBS / Scott Cardwell \"Joel Ma told me that being Congolese and speaking Swahili makes my music unique,\" he said.\n\n\n\n\n\n\"So, each song has a story. It is either something that I experienced or that someone close to me has experienced.\n\n\n\n\n\n\"I put that into the music and people relate, they say ‘oh wait, I've been through that too’. And so they connect.\n\n\n\n\n\n\"They also send me messages which might be little in text, but they are big in heart.\n\n\n\n\n\n\"And it makes me feel good that so many people are able to open up by hearing my words,\" he said.",
      "frequency": 1
    }
  ]
}